[
    {
        "id": 93198115,
        "title": "Psych Prof Who Called Trump 'Mentally Impaired' May Not Have A License",
        "body": "The Yale University psychology professor who called President Trump “mentally impaired” appears to lack a valid license to practice psychiatry in her home state of Connecticut.\nThe prominent professor Bandy Lee made the headlines over the past few days when she made a diagnosis of the president as suffering from a “mental impairment” that would disqualify him from the highest office in the land.\nFollowing Lee’s comments, the American Psychiatric Association released a statement on Tuesday warning members of its profession to refrain from making public diagnoses of public figures like Trump without a proper medical exam.\n“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” wrote the APA, without mentioning Lee specifically. “Arm-chair psychiatry or the use of psychiatry as a political tool is the misuse of psychiatry and is unacceptable and unethical.”\n\n\n\n\nLee and her colleague responded to the issue in a piece to Politico on Wednesday, in which they claimed it is “perfectly OK to question the president’s mental state” because of their profession as “psychiatrists.”\nThe professor, who has met with lawmakers in Capitol Hill to talk about the issue, is now facing scrutiny amid allegations that she is not licensed to practice psychology in Connecticut.\nCampus Reform reports that state records indicate that Lee’s “physician/surgeon” license expired some three years ago — on May 31, 2015 — and that her application for reinstatement has been pending ever since. The publication was able to produce Lee’s license details to back up the claim.\nIn addition to her pending physician’s license, the professor’s “controlled substance registration for practitioner” license is also lapsed, having expired last February. In other words, Lee is not legally able to prescribe medication as a medical practitioner.\n\n\n\nLee responded to Campus Reform’s inquiries, stating simply: “I only need one license.” She did not clarify precisely what license she has, or in which state she is registered.\nAs TheDC’s Joe Simonson writes, the U.S. president’s public meeting with congress shattered the narrative that he is mentally unfit to run the country.\nIan Miles Cheong is a journalist and outspoken media critic. You can reach him through social media at @stillgray on Twitter and on Facebook.",
        "summary": {
            "sentences": [
                "The Yale University psychology professor who called President Trump “mentally impaired” appears to lack a valid license to practice psychiatry in her home state of Connecticut.",
                "The prominent professor Bandy Lee made the headlines over the past few days when she made a diagnosis of the president as suffering from a “mental impairment” that would disqualify him from the highest office in the land.",
                "“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” wrote the APA, without mentioning Lee specifically.",
                "Lee and her colleague responded to the issue in a piece to Politico on Wednesday, in which they claimed it is “perfectly OK to question the president’s mental state” because of their profession as “psychiatrists.”",
                "Campus Reform reports that state records indicate that Lee’s “physician/surgeon” license expired some three years ago — on May 31, 2015 — and that her application for reinstatement has been pending ever since."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.711994
            },
            "body": {
                "polarity": "neutral",
                "score": 0.885591
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://dailycaller.com/2018/01/10/psych-prof-who-called-trump-mentally-impaired-may-not-have-a-license-to-practice/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93198115",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93198115",
            "canonical": null
        }
    },
    {
        "id": 93457456,
        "title": "Records show psych professor who ‘diagnosed’ Trump as crazy doesn't have a license",
        "body": "Now, that’s ironic. It turns out that the Yale professor/psychiatrist who diagnosed Trump as crazy, doesn’t have a valid license in her home state of Connecticut. Allegations, accusations and rumors started swarming on Twitter about this woman. Bandy Lee also just deleted her Twitter account. All of this stems from her making an unethical diagnosis of President Trump as mentally unstable and then meeting with a dozen Democrats last December over it. She even said he should be physically removed from office and committed. That’s called a coup.\n\nFollowing Lee’s comments, the American Psychiatric Association released a statement on Tuesday warning members of its profession to refrain from making public diagnoses of public figures like Trump without a proper medical exam. She has never even met the President, so Lee violated the Goldwater Rule big time here. The Goldwater rule is the informal name given to Section 7 in the American Psychiatric Association’s (APA) Principles of Medical Ethics that states it is unethical for psychiatrists to give a professional opinion about public figures they have not examined in person and from whom they have not obtained consent to discuss their mental health in public statements. It is named after presidential candidate Barry Goldwater.\n\n“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” wrote the APA, without mentioning Lee specifically. “Arm-chair psychiatry or the use of psychiatry as a political tool is the misuse of psychiatry and is unacceptable and unethical.” Lee is back-pedaling on this as fast as she can now, but it’s too late for her. Perhaps it will be a lesson to other so-called mental health professionals who decide to mix politics with their profession.\n\nLee and her colleague responded to the issue in a piece to Politico on Wednesday, in which they claimed it is “perfectly okay to question the President’s mental state” because of their profession as “psychiatrists.” No, it is not. Not even if she was actually licensed and the APA backs me up on this. According to Campus Reform, state records indicate that Lee’s “physician/surgeon” license expired some three years ago — on May 31, 2015 — and that her application for reinstatement has been pending ever since. The publication was able to produce Lee’s license details to back up the claim.\n\nAlso at issue here is Lee’s “controlled substance registration for practitioner” license that has also lapsed, having expired last February. In other words, Lee is not legally able to prescribe medication as a medical practitioner. When responding to Campus Reform, Lee stated, “I only need one license.” She did not clarify precisely what license she has, or in which state she is registered. After this public mess, her license is unlikely to be renewed. And it shouldn’t be.",
        "summary": {
            "sentences": [
                "Following Lee’s comments, the American Psychiatric Association released a statement on Tuesday warning members of its profession to refrain from making public diagnoses of public figures like Trump without a proper medical exam.",
                "The Goldwater rule is the informal name given to Section 7 in the American Psychiatric Association’s (APA) Principles of Medical Ethics that states it is unethical for psychiatrists to give a professional opinion about public figures they have not examined in person and from whom they have not obtained consent to discuss their mental health in public statements.",
                "“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” wrote the APA, without mentioning Lee specifically.",
                "Lee and her colleague responded to the issue in a piece to Politico on Wednesday, in which they claimed it is “perfectly okay to question the President’s mental state” because of their profession as “psychiatrists.”",
                "According to Campus Reform, state records indicate that Lee’s “physician/surgeon” license expired some three years ago — on May 31, 2015 — and that her application for reinstatement has been pending ever since."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.678828
            },
            "body": {
                "polarity": "negative",
                "score": 0.778723
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://rightwingnews.com/donald-trump/records-show-psych-professor-diagnosed-trump-crazy-doesnt-license/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93457456",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93457456",
            "canonical": null
        }
    },
    {
        "id": 93759538,
        "title": "Records Show Psych Prof Who 'Diagnosed' Trump \"Unfit\" Lacks License",
        "body": "Authored by Anthony Gockowski via Campus Reform,\n\nYale University psychology professor Bandy Lee has deleted her Twitter account amid mounting allegations that she is not licensed in her home state of Connecticut.\n\n \n\n\n\nAccusations have been circulating on Twitter that the prominent Yale professor, known for her public diagnosis of President Donald Trump as having a “mental impairment” and who recently met with lawmakers on Capitol Hill to discuss the issue, isn’t actually a licensed psychiatrist.\n\nIn fact, Campus Reform discovered that according to the State of Connecticut, Lee’s “physician/surgeon” license expired in 2015, and her application for reinstatement has been “pending” ever since.\n\n \n\n\n\nAdditionally, her “controlled substance registration for practitioner” license has apparently “lapsed,” expiring in February 2017.\n\n \n\n\n\nIn response to Campus Reform’s inquiry on the matter, Lee simply stated that “I need only one license,” though she has yet to elaborate on precisely which license that is, and, according to the state in which she resides, she allegedly has none.\n\nWithout mentioning Lee specifically, the American Psychiatric Association (APA) put out a recent statement in which it condemned the diagnoses of public officials whom psychiatrists have not personally examined, invoking what is commonly referred to as the Goldwater Rule.\n\n\n“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” the statement read, according to The Washington Examiner.\n\n“Arm-chair psychiatry or the use of psychiatry as a political tool is the misuse of psychiatry and is unacceptable and unethical,” the APA concluded.\n\n\nLee and a colleague, however, responded to criticisms in a Wednesday POLITICO piece, in which they claim that “it’s perfectly OK to question the president’s mental state,” since they are “psychiatrists.”",
        "summary": {
            "sentences": [
                "Authored by Anthony Gockowski via Campus Reform,\n\nYale University psychology professor Bandy Lee has deleted her Twitter account amid mounting allegations that she is not licensed in her home state of Connecticut.",
                "Accusations have been circulating on Twitter that the prominent Yale professor, known for her public diagnosis of President Donald Trump as having a “mental impairment” and who recently met with lawmakers on Capitol Hill to discuss the issue, isn’t actually a licensed psychiatrist.",
                "In fact, Campus Reform discovered that according to the State of Connecticut, Lee’s “physician/surgeon” license expired in 2015, and her application for reinstatement has been “pending” ever since.",
                "Without mentioning Lee specifically, the American Psychiatric Association (APA) put out a recent statement in which it condemned the diagnoses of public officials whom psychiatrists have not personally examined, invoking what is commonly referred to as the Goldwater Rule.",
                "Lee and a colleague, however, responded to criticisms in a Wednesday POLITICO piece, in which they claim that “it’s perfectly OK to question the president’s mental state,” since they are “psychiatrists.”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.857764
            },
            "body": {
                "polarity": "neutral",
                "score": 0.588304
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://feedproxy.google.com/~r/zerohedge/feed/~3/k921DB6h_3Q/records-show-psych-prof-who-diagnosed-trump-unfit-lacks-license",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93759538",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93759538",
            "canonical": "https://www.zerohedge.com/news/2018-01-12/records-show-psych-prof-who-diagnosed-trump-unfit-lacks-license"
        }
    },
    {
        "id": 93753955,
        "title": "No license? Psych callng to restrain Trump missing something yuuge",
        "body": "A psychiatrist who claimed to have briefed more than a dozen U.S. lawmakers on President Trump’s mental state – demanding an “emergency” evaluation and even restraint by force of the president – may not even have a license in her home state of Connecticut.\n\nAs WND reported, Bandy Lee, an assistant professor in forensic psychiatry at the Yale School of Medicine and author of “The Dangerous Case of Donald Trump,” says she briefed Democrats and one Republican on Trump’s mental health status on Dec. 5 and 6. Lee and Harvard’s Judith Herman and Columbia’s Robert Jay Lifton. The three recently released a statement warning that Trump is “further unraveling,” despite the fact that they’ve never actually examined the president.\n\nLee even claimed failure to address President Trump’s declining mental-health state could lead to “the extinction of the human species.”\n\nSince her calls for evaluation and restraint of Trump were made public, Lee has deleted her Twitter account. Users of the site have claimed she’s not even a licensed psychiatrist.\n\nLee’s “physician/surgeon” license  in Connecticut expired on May 31, 2015, Campus Reform reported. Her reinstatement application has been “pending” for more than two years.\n\nCampus Reform also noted that Lee’s “controlled substance registration for practitioner” license “lapsed,” expiring in February 2017.\n\nWhen the site questioned Lee about the licenses, she replied: “I need only one license.”\n\n“She has yet to elaborate on precisely which license that is, and, according to the state in which she resides, she allegedly has none,” reported Campus Reform.\n\nLee, who previously claimed the three are not “diagnosing” the president, said, “We are mainly concerned that an emergency evaluation be done.”\n\nShe told Vox.com she’s concerned that if Trump is having a mental breakdown, the situation could lead to U.S. military action against North Korea and a nuclear holocaust.\n\n“[T]hat is not the only danger we’re facing,” Lee insisted. “There’s everything in between: provoking our allies and alienating them, instigating civil conflict, and laying a foundation for a violent culture that could give way to epidemics of violence — not to mention poke a beehive in the Middle East by declaring Jerusalem as Israel’s capital. All of these actions are consistent with the pathological pattern he has already shown of resorting to violence the more he feels threatened.”\n\nLee even insisted no “serious” psychiatrist would say Trump isn’t “dangerous.”\n\n“It would be hard to find a single psychiatrist, no matter of what political affiliation, who could confidently say Trump is not dangerous,” she said. “I am sure there are some who feel unsure, or feel that they don’t have enough information or the expertise, and that is fine, since not everyone has devoted her 20-year career to studying, predicting, and preventing violence like I have. But there has not been a single serious mental health expert who disagrees on the medical side.”\n\nHow can psychiatrists evaluate President Trump if he won’t voluntarily submit to an evaluation?\n\nLee suggested a forceful evaluation, but she warned it could “really look like a coup”:\n\nWe encounter this often in mental health. Those who most require an evaluation are the least likely to submit to one. That is the reason why in all 50 states we have not only the legal authority, but often the legal obligation, to contain someone even against their will when it’s an emergency. So in an emergency, neither consent nor confidentiality requirements hold. Safety comes first. What we do in the case of danger is we contain the person, we remove them from access to weapons, and we do an urgent evaluation. This is what we have been calling for with the president based on basic medical standards of care. Surprisingly, many lawyer groups have actually volunteered, on their own, to file for a court paper to ensure that the security staff will cooperate with us. But we have declined, since this will really look like a coup, and while we are trying to prevent violence, we don’t wish to incite it through, say, an insurrection.\n\nLee said she has been discussing this scenario with lawmakers on Capitol Hill, and they “seem surprisingly OK” with what she had to say.\n\nAs WND reported last July, it has long been considered unethical for psychiatrists to “diagnose” politicians or public figures based solely on that person’s public actions or statements, without conducting an actual in-person examination. But now that Trump is president, a national psychology organization, the American Psychoanalytic Association, has given psychoanalysts the green light to publicly comment on Trump’s mental health.\n\nSince Lee’s statements were made public, the American Psychiatric Association released a statement urging psychiatrists to stop trying to evaluate Trump when they’ve never even examined him.\n\n“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” the American Psychiatric Association’s statement said. “Arm-chair psychiatry or the use of psychiatry as a political tool is the misuse of psychiatry and is unacceptable and unethical.”\n\nAs WND reported, without ever having examined Trump, psychological professionals have called the president “psychotic,” “narcissistic,” “paranoid,” “hypomanic,” “emotionally  isolated” and claimed he has a “dangerous mental illness.” One physician suggested Trump could be suffering from an untreated sexually transmitted disease known as neurosyphilis.\n\nSome mental health “experts” have even gone so far as to call conservatism a mental illness, claiming prominent Republicans have shown signs of denial, delusion, hallucination, disordered thinking, anger, anti-social behavior, sexual preoccupation, grandiosity, general oddness and paranoia.\n\nIn a Politico piece Wednesday, “We’re psychiatrists. It’s our duty to question the president’s mental state,” Lee claimed “it’s perfectly OK to question the president’s mental state” because she’s a “psychiatrist.”",
        "summary": {
            "sentences": [
                "A psychiatrist who claimed to have briefed more than a dozen U.S. lawmakers on President Trump’s mental state – demanding an “emergency” evaluation and even restraint by force of the president – may not even have a license in her home state of Connecticut.",
                "As WND reported, Bandy Lee, an assistant professor in forensic psychiatry at the Yale School of Medicine and author of “The Dangerous Case of Donald Trump,” says she briefed Democrats and one Republican on Trump’s mental health status on Dec. 5 and 6.",
                "Lee even insisted no “serious” psychiatrist would say Trump isn’t “dangerous.”",
                "Since Lee’s statements were made public, the American Psychiatric Association released a statement urging psychiatrists to stop trying to evaluate Trump when they’ve never even examined him.",
                "It’s our duty to question the president’s mental state,” Lee claimed “it’s perfectly OK to question the president’s mental state” because she’s a “psychiatrist.”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.509502
            },
            "body": {
                "polarity": "negative",
                "score": 0.989459
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.wnd.com/2018/01/no-license-psych-callng-to-restrain-trump-missing-something-yuuge/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93753955",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93753955",
            "canonical": null
        }
    },
    {
        "id": 93357991,
        "title": "No license? Records show psych professor who ‘diagnosed’ Trump is missing something important",
        "body": "Yale University psychology professor Bandy Lee has deleted her Twitter account amid mounting allegations that she is not licensed in her home state of Connecticut.\n\nAccusations have been circulating on Twitter that the prominent Yale professor, known for her public diagnosis of President Donald Trump as having a “mental impairment” and who recently met with lawmakers on Capitol Hill to discuss the issue, isn’t actually a licensed psychiatrist.\n\nIn fact, Campus Reform discovered that according to the State of Connecticut, Lee’s “physician/surgeon” license expired in 2015, and her application for reinstatement has been “pending” ever since.\n\nAdditionally, her “controlled substance registration for practitioner” license has apparently “lapsed,” expiring in February 2017.\n\nIn response to Campus Reform’s inquiry on the matter, Lee simply stated that “I need only one license,” though she has yet to elaborate on precisely which license that is, and, according to the state in which she resides, she allegedly has none.\n\nWithout mentioning Lee specifically, the American Psychiatric Association (APA) put out a recent statement in which it condemned the diagnoses of public officials whom psychiatrists have not personally examined, invoking what is commonly referred to as the Goldwater Rule.\n\n“We at the APA call for an end to psychiatrists providing professional opinions in the media about public figures whom they have not examined, whether it be on cable news appearances, books, or in social media,” the statement read, according to The Washington Examiner.\n\n“Arm-chair psychiatry or the use of psychiatry as a political tool is the misuse of psychiatry and is unacceptable and unethical,” the APA concluded.\n\nLee and a colleague, however, responded to criticisms in a Wednesday POLITICO piece, in which they claim that “it’s perfectly OK to question the president’s mental state,” since they are “psychiatrists.”\n\nFollow the author of this article on Twitter: @AGockowski\n\nCampus Reform exposes the liberal bias and abuse against conservatives on America’s colleges and universities.\n\nAs a Campus Reform reader, you know about the abuse taking place at our nation’s higher education institutions, and you know how important it is to bring these stories to light.\n\nCollege campuses are no longer bastions of higher learning. Professors indoctrinate students with their agendas. They even silence conservative students with their attempts to suppress free speech.\n\nSource: No license? Records show psych professor who ‘diagnosed’ Trump is missing something important",
        "summary": {
            "sentences": [
                "Yale University psychology professor Bandy Lee has deleted her Twitter account amid mounting allegations that she is not licensed in her home state of Connecticut.",
                "Accusations have been circulating on Twitter that the prominent Yale professor, known for her public diagnosis of President Donald Trump as having a “mental impairment” and who recently met with lawmakers on Capitol Hill to discuss the issue, isn’t actually a licensed psychiatrist.",
                "In fact, Campus Reform discovered that according to the State of Connecticut, Lee’s “physician/surgeon” license expired in 2015, and her application for reinstatement has been “pending” ever since.",
                "In response to Campus Reform’s inquiry on the matter, Lee simply stated that “I need only one license,” though she has yet to elaborate on precisely which license that is, and, according to the state in which she resides, she allegedly has none.",
                "Without mentioning Lee specifically, the American Psychiatric Association (APA) put out a recent statement in which it condemned the diagnoses of public officials whom psychiatrists have not personally examined, invoking what is commonly referred to as the Goldwater Rule."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.550316
            },
            "body": {
                "polarity": "negative",
                "score": 0.415467
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.educationviews.org/no-license-records-show-psych-professor-who-diagnosed-trump-is-missing-something-important/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93357991",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93357991",
            "canonical": null
        }
    },
    {
        "id": 93673267,
        "title": "Mentally Ill Or Not, Donald Trump Has Proven He Is Far From 'Stable'",
        "body": "Donald Trump and his White House, reeling from depictions in Michael Wolff’s instant bestseller Fire and Fury, were desperate this week to show that the president is in command and mentally fit, following up on Trump’s tweet in response to the book last weekend claiming he is a “stable genius.”\nThe administration even put on a show in the form of a televised meeting with lawmakers about the DACA program and immigration on Tuesday. It was a show that had a few pundits and White House reporters, once again, cooing about Trump’s “capability,” which some of them implied disproved the allegations in the book ― largely because they’ve lowered the bar so much for Trump. This, even though Trump contradicted himself throughout the meeting, baffling viewers about his actual positions, and sending conservative commentators into a tailspin when he appeared to side momentarily with Democrats on comprehensive immigration reform.\nNear the weeks’s end, however, Trump undid whatever little bit of rehabilitation he had achieved, when, according to people in the room, including Sen. Dick Durbin (D-Ill.), the president railed against immigrants from “shithole countries” and said that he preferred immigrants from places “like Norway.” (The White House didn’t deny the report, first published in The Washington Post Thursday afternoon, though over 18 hours later Trump suggested it wasn’t true in a tweet.) The blow up occurred at a bipartisan private meeting of lawmakers on Thursday in which Trump clearly couldn’t control his contempt for people of color. He proved himself to be every bit like the depictions of him in Fire and Fury.\n\nThe debate about Trump’s emotional stability ended a long time ago.\n\n\nToo many people, including many in the media and even Trump himself, have confused mental impairment and emotional stability.\nPeople can of course be mentally ill and yet quite stable. And there are many people who aren’t in any way mentally impaired, but are highly emotionally unstable ― prone to outbursts, impulsiveness, temper tantrums and other erratic behavior that often displays their anger, resentment and animus toward groups or individuals.\nIn Fire And Fury, Wolff quoted people in the White House calling Trump an “idiot” and a “moron.” He wrote that people around Trump describe him as as being “like a child” and that “100 percent” of them believe he is not “fit” for office. And he documented Trump’s odd repetition of phrases and anecdotes while speaking, saying it was becoming more pronounced. On the “Today” show, while describing this behavior, Wollff quoted Steve Bannon saying, “He’s lost it.” \nThat last description clearly depicts Trump as mentally impaired and perhaps getting worse. But that is something none of us could know. Only a trained mental health professional examining Trump in a face-to-face psychiatric or psychological evaluation could determine that.\nBut Trump’s emotional stability doesn’t rest on his being mentally impaired. The televised immigration meeting, as was plain for all to see, was all about feeding a fragile, deeply insecure man who was starved for validation, something that was made clear by his comments the next day.\n“Actually it was [the meeting] reported as incredibly good. And my performance ― some of it called it a performance, I consider it work. But it got great reviews by everybody other than two networks who were phenomenal for about two hours,” Trump said. “I’m sure their ratings were fantastic.” \nHe even claimed that news anchors sent letters to the White House praising his performance.\nTrump’s unhinged tweets throughout the week suggest that he was motivated by increased fears about the Russia investigation (targeting “sneaky Dianne Feinstein” for releasing a revealing transcript from Senate Judiciary Committee testimony), his seething anger at the Wolff book, and much else that had him lashing out impulsively.\nOn Thursday morning, Trump threw Congress into chaos as it was set to vote on reauthorizing the NSA’s warrantless wiretapping program when he tweeted against the program and his administration’s own position on it, all because of his anxiety and fear that it had been used to surveil his election campaign and kick off the FBI’s probe into possible collusion between his campaign and Russia.\nWith that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart!— Donald J. Trump (@realDonaldTrump) January 11, 2018\n\nIt reportedly took a phone call from House Speaker Paul Ryan to convince Trump that the program was focused on foreign surveillance (though it can wiretap American citizens communicating with those outside the country), leading the president to flip an hour later and tweet support for the program ― again, a program that his own White House already supported, a fact about which he seemed to be completely out of touch.\nIn a televised cabinet meeting on Thursday, meant to lay out the administration’s and the GOP’s priorities for 2018, Trump suddenly announced that his administration would take “a strong look” at tightening libel laws ― though there actually are no federal libel laws ― something that no Republican in Congress is likely to have any interest in addressing at a time when they’d like to talk up having passed their tax bill and focus on other priorities. Revealing he was likely still fuming about Fire and Fury, Trump’s announcement once again diverted media attention from the GOP agenda to Trump’s authoritarian impulses and support for media censorship.\nAnd let’s not forget Trump’s reckless tweet just before the first excerpt of Fire and Fury went public last week, in which he taunted North Korea’s Kim Jong Un about his bigger “nuclear button.”\nThe debate about Trump’s emotional stability ended a long time ago, though this week, because of the Wolff book and the responses to it, Trump’s stability seemed to get conflated with other things that became easier for the administration to challenge, with the help of some gullible or access-driven journalists. We shouldn’t get bogged down in whether or not Trump is mentally impaired.\nNo matter his mental health, in a week in which Trump and the White House were intent on pushing back against Fire and Fury and presenting the president as stable and mentally fit, he displayed, in spectacular fashion, his uncontrolled and bigoted rage, his impulsiveness and his instability.\nWhatever the underlying causes, this week proved, once again, that Donald Trump is dangerous and unfit for the presidency.\nFollow Michelangelo Signorile on",
        "summary": {
            "sentences": [
                "Donald Trump and his White House, reeling from depictions in Michael Wolff’s instant bestseller Fire and Fury, were desperate this week to show that the president is in command and mentally fit, following up on Trump’s tweet in response to the book last weekend claiming he is a “stable genius.”",
                "In Fire And Fury, Wolff quoted people in the White House calling Trump an “idiot” and a “moron.”",
                "— Donald J. Trump (@realDonaldTrump) January 11, 2018\n\nIt reportedly took a phone call from House Speaker Paul Ryan to convince Trump that the program was focused on foreign surveillance (though it can wiretap American citizens communicating with those outside the country), leading the president to flip an hour later and tweet support for the program ― again, a program that his own White House already supported, a fact about which he seemed to be completely out of touch.",
                "The debate about Trump’s emotional stability ended a long time ago, though this week, because of the Wolff book and the responses to it, Trump’s stability seemed to get conflated with other things that became easier for the administration to challenge, with the help of some gullible or access-driven journalists.",
                "No matter his mental health, in a week in which Trump and the White House were intent on pushing back against Fire and Fury and presenting the president as stable and mentally fit, he displayed, in spectacular fashion, his uncontrolled and bigoted rage, his impulsiveness and his instability."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.492421
            },
            "body": {
                "polarity": "negative",
                "score": 0.799536
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.huffingtonpost.com/entry/mentally-ill-or-not-trump-far-from-stable_us_5a578721e4b0330eab08cfc8?ncid=inblnkushpmg00000009",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93673267",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93673267",
            "canonical": null
        }
    },
    {
        "id": 93753849,
        "title": "Mentally Ill Or Not, Donald Trump Has Proven He Is Far From 'Stable'",
        "body": "Donald Trump and his White House, reeling from depictions in Michael Wolff’s instant bestseller Fire and Fury, were desperate this week to show that the president is in command and mentally fit, following up on Trump’s tweet in response to the book last weekend claiming he is a “stable genius.”\n\nThe administration even put on a show in the form of a televised meeting with lawmakers about the DACA program and immigration on Tuesday. It was a show that had a few pundits and White House reporters, once again, cooing about Trump’s “capability,” which some of them implied disproved the allegations in the book ― largely because they’ve lowered the bar so much for Trump. This, even though Trump contradicted himself throughout the meeting, baffling viewers about his actual positions, and sending conservative commentators into a tailspin when he appeared to side momentarily with Democrats on comprehensive immigration reform.\n\nNear the weeks’s end, however, Trump undid whatever little bit of rehabilitation he had achieved, when, according to people in the room, including Sen. Dick Durbin (D-Ill.), the president railed against immigrants from “shithole countries” and said that he preferred immigrants from places “like Norway.” (The White House didn’t deny the report, first published in The Washington Post Thursday afternoon, though over 18 hours later Trump suggested it wasn’t true in a tweet.) The blow up occurred at a bipartisan private meeting of lawmakers on Thursday in which Trump clearly couldn’t control his contempt for people of color. He proved himself to be every bit like the depictions of him in Fire and Fury.\n\nToo many people, including many in the media and even Trump himself, have confused mental impairment and emotional stability.\n\nPeople can of course be mentally ill and yet quite stable. And there are many people who aren’t in any way mentally impaired, but are highly emotionally unstable ― prone to outbursts, impulsiveness, temper tantrums and other erratic behavior that often displays their anger, resentment and animus toward groups or individuals.\n\nIn Fire And Fury, Wolff quoted people in the White House calling Trump an “idiot” and a “moron.” He wrote that people around Trump describe him as as being “like a child” and that “100 percent” of them believe he is not “fit” for office. And he documented Trump’s odd repetition of phrases and anecdotes while speaking, saying it was becoming more pronounced. On the “Today” show, while describing this behavior, Wollff quoted Steve Bannon saying, “He’s lost it.”\n\nThat last description clearly depicts Trump as mentally impaired and perhaps getting worse. But that is something none of us could know. Only a trained mental health professional examining Trump in a face-to-face psychiatric or psychological evaluation could determine that.\n\nBut Trump’s emotional stability doesn’t rest on his being mentally impaired. The televised immigration meeting, as was plain for all to see, was all about feeding a fragile, deeply insecure man who was starved for validation, something that was made clear by his comments the next day.\n\n“Actually it was [the meeting] reported as incredibly good. And my performance ― some of it called it a performance, I consider it work. But it got great reviews by everybody other than two networks who were phenomenal for about two hours,” Trump said. “I’m sure their ratings were fantastic.”  He even claimed that news anchors sent letters to the White House praising his performance. Trump’s unhinged tweets throughout the week suggest that he was motivated by increased fears about the Russia investigation (targeting “sneaky Dianne Feinstein” for releasing a revealing transcript from Senate Judiciary Committee testimony), his seething anger at the Wolff book, and much else that had him lashing out impulsively. On Thursday morning, Trump threw Congress into chaos as it was set to vote on reauthorizing the NSA’s warrantless wiretapping program when he tweeted against the program and his administration’s own position on it, all because of his anxiety and fear that it had been used to surveil his election campaign and kick off the FBI’s probe into possible collusion between his campaign and Russia. With that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart! — Donald J. Trump (@realDonaldTrump) January 11, 2018 It reportedly took a phone call from House Speaker Paul Ryan to convince Trump that the program was focused on foreign surveillance (though it can wiretap American citizens communicating with those outside the country), leading the president to flip an hour later and tweet support for the program ― again, a program that his own White House already supported, a fact about which he seemed to be completely out of touch. In a televised cabinet meeting on Thursday, meant to lay out the administration’s and the GOP’s priorities for 2018, Trump suddenly announced that his administration would take “a strong look” at tightening libel laws ― though there actually are no federal libel laws ― something that no Republican in Congress is likely to have any interest in addressing at a time when they’d like to talk up having passed their tax bill and focus on other priorities. Revealing he was likely still fuming about Fire and Fury, Trump’s announcement once again diverted media attention from the GOP agenda to Trump’s authoritarian impulses and support for media censorship. And let’s not forget Trump’s reckless tweet just before the first excerpt of Fire and Fury went public last week, in which he taunted North Korea’s Kim Jong Un about his bigger “nuclear button.” The debate about Trump’s emotional stability ended a long time ago, though this week, because of the Wolff book and the responses to it, Trump’s stability seemed to get conflated with other things that became easier for the administration to challenge, with the help of some gullible or access-driven journalists. We shouldn’t get bogged down in whether or not Trump is mentally impaired. No matter his mental health, in a week in which Trump and the White House were intent on pushing back against Fire and Fury and presenting the president as stable and mentally fit, he displayed, in spectacular fashion, his uncontrolled and bigoted rage, his impulsiveness and his instability. Whatever the underlying causes, this week proved, once again, that Donald Trump is dangerous and unfit for the presidency.",
        "summary": {
            "sentences": [
                "Donald Trump and his White House, reeling from depictions in Michael Wolff’s instant bestseller Fire and Fury, were desperate this week to show that the president is in command and mentally fit, following up on Trump’s tweet in response to the book last weekend claiming he is a “stable genius.”",
                "In Fire And Fury, Wolff quoted people in the White House calling Trump an “idiot” and a “moron.”",
                "— Donald J. Trump (@realDonaldTrump) January 11, 2018 It reportedly took a phone call from House Speaker Paul Ryan to convince Trump that the program was focused on foreign surveillance (though it can wiretap American citizens communicating with those outside the country), leading the president to flip an hour later and tweet support for the program ― again, a program that his own White House already supported, a fact about which he seemed to be completely out of touch.",
                "In a televised cabinet meeting on Thursday, meant to lay out the administration’s and the GOP’s priorities for 2018, Trump suddenly announced that his administration would take “a strong look” at tightening libel laws ― though there actually are no federal libel laws ― something that no Republican in Congress is likely to have any interest in addressing at a time when they’d like to talk up having passed their tax bill and focus on other priorities.",
                "No matter his mental health, in a week in which Trump and the White House were intent on pushing back against Fire and Fury and presenting the president as stable and mentally fit, he displayed, in spectacular fashion, his uncontrolled and bigoted rage, his impulsiveness and his instability."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.492421
            },
            "body": {
                "polarity": "negative",
                "score": 0.838826
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.yahoo.com/news/mentally-ill-not-donald-trump-175653255.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93753849",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93753849",
            "canonical": null
        }
    },
    {
        "id": 93725682,
        "title": "Texas moves to shut down Timberlawn psych hospital over patient safety",
        "body": "This story is being continuously updated.Texas health officials are trying to close Timberlawn psychiatric hospital over safety problems after a 13-year-old girl reported that she was raped there last fall by another patient, a 17-year-old boy.The state's move to revoke Timberlawn's license, announced Friday, is one of the strongest steps it can take against healthcare facilities. The hospital was already the only psych facility on probation with the state because of past safety violations. Timberlawn said it plans to appeal. In 2016, it successfully fought a similar shut-down effort, in part by paying a fine and agreeing to improve patient care.“Moving toward license revocation is absolutely warranted here,” said Carrie Williams, spokeswoman for the Texas Health and Human Services Commission, which oversees psychiatric hospitals.“We continued to see the same problems over and over again, some of them quite serious,” she said. “We have to hold hospitals accountable, especially when patient rights and safety are concerned.\"The state also threatened Timberlawn with a $600,000 fine.Timberlawn is the oldest residential facility for mentally ill patients in the Dallas area and has historically been one of the largest. It is owned by Universal Health Services, a $10 billion publicly traded company that operates hundreds of hospitals nationwide, including others in North Texas.A spokeswoman for Universal Health Services did not immediately respond to a request for comment.",
        "summary": {
            "sentences": [
                "This story is being continuously updated.Texas health officials are trying to close Timberlawn psychiatric hospital over safety problems after a 13-year-old girl reported that she was raped there last fall by another patient, a 17-year-old boy.The state's move to revoke Timberlawn's license, announced Friday, is one of the strongest steps it can take against healthcare facilities.",
                "The hospital was already the only psych facility on probation with the state because of past safety violations.",
                "“Moving toward license revocation is absolutely warranted here,” said Carrie Williams, spokeswoman for the Texas Health and Human Services Commission, which oversees psychiatric hospitals.",
                "“We have to hold hospitals accountable, especially when patient rights and safety are concerned.",
                "\"The state also threatened Timberlawn with a $600,000 fine.Timberlawn is the oldest residential facility for mentally ill patients in the Dallas area and has historically been one of the largest."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.49837
            },
            "body": {
                "polarity": "negative",
                "score": 0.673413
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.dallasnews.com/news/investigations/2018/01/12/texas-moves-shut-timberlawn-psych-hospital-patient-safety",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93725682",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93725682",
            "canonical": null
        }
    },
    {
        "id": 93458579,
        "title": "Trump says he ‘probably’ has a good relationship with Kim Jong Un, who he’s called a ‘short and fat’ ‘madman’",
        "body": "President Donald Trump, who has called North Korea’s leader Kim Jong Un “Rocket Man,” “short and fat” and a \"madman\" on Thursday claimed he probably has a positive relationship with the dictator—but refused to disclose if he’s even spoken to Kim.\n\n“I probably have a very good relationship with Kim Jong Un,” Trump said in an interview with The Wall Street Journal. “I have relationships with people. I think you people are surprised.”\n\nBut asked whether he has talked to Kim, Trump answered: “I don’t want to comment on it. I’m not saying I have or haven’t. I just don’t want to comment.”\n\nKeep up with this story and more by subscribing now\n\nTrump said his insulting comments, which also include calling Kim a “maniac” and a “bad dude,” are part of his larger strategy.\n\n“You’ll see that a lot with me,” the president said about his inflammatory tweets, “and then all of the sudden somebody’s my best friend. I could give you 20 examples. You could give me 30. I’m a very flexible person.”\n\nKim may not feel as friendly toward Trump, based on what he’s said about the president. The North Korean leader has threatened to “tame the mentally deranged U.S. dotard with fire.”\n\nTrump’s “good relationship” comment suggests he may newly be open to diplomacy. In recent days south Korea has reopened diplomatic channels with its long-time foe.",
        "summary": {
            "sentences": [
                "President Donald Trump, who has called North Korea’s leader Kim Jong Un “Rocket Man,” “short and fat” and a \"madman\" on Thursday claimed he probably has a positive relationship with the dictator—but refused to disclose if he’s even spoken to Kim.",
                "“I probably have a very good relationship with Kim Jong Un,” Trump said in an interview with The Wall Street Journal.",
                "Keep up with this story and more by subscribing now\n\nTrump said his insulting comments, which also include calling Kim a “maniac” and a “bad dude,” are part of his larger strategy.",
                "Kim may not feel as friendly toward Trump, based on what he’s said about the president.",
                "Trump’s “good relationship” comment suggests he may newly be open to diplomacy."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "positive",
                "score": 0.514775
            },
            "body": {
                "polarity": "negative",
                "score": 0.851849
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://europe.newsweek.com/trump-kim-jong-un-relationship-778999",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93458579",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93458579",
            "canonical": null
        }
    },
    {
        "id": 93434044,
        "title": "Judge sends man charged in train shooting to senior facility",
        "body": "WHEATON, Ill. (AP) - A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.\n\nThe (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness.\n\nKlein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.\n\nThis undated photo provided by the DuPage County State's Attorney's Office shows Edward Klein. Klein, who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility. An Illinois judge on Wednesday, Jan. 10, 2018, said he doubted Klein would be restored to fitness. Klein will go to a Wauwatosa, Wis., facility that specializes in care for patients with dementia. He is prohibited from leaving except for an emergency. (DuPage County State's Attorney's Office via AP)\n\nKlein has been held on $1.5 million bail since the shooting in Naperville. Conductor Michael Case testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.\n\nDoctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder. He's from West Allis, Wisconsin.",
        "summary": {
            "sentences": [
                "WHEATON, Ill. (AP) - A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.",
                "Klein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia.",
                "Klein, who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.",
                "Klein will go to a Wauwatosa, Wis., facility that specializes in care for patients with dementia.",
                "(DuPage County State's Attorney's Office via AP)\n\nKlein has been held on $1.5 million bail since the shooting in Naperville."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.496248
            },
            "body": {
                "polarity": "neutral",
                "score": 0.652292
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.dailymail.co.uk/wires/ap/article-5260253/Judge-sends-man-charged-train-shooting-senior-facility.html?ITO=1490&ns_mchannel=rss&ns_campaign=1490",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93434044",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93434044",
            "canonical": null
        }
    },
    {
        "id": 93605259,
        "title": "Let's get a physical! Trump, 71, gets first checkup but no psych eval",
        "body": "Donald Trump will submit himself for his first health checkup as president this afternoon.\n\nThe 71-year-old will be assessed at Walter Reed Medical Center in Bethesda, Maryland, by Navy doctor Ronny Jackson, a holdover from the previous administration.\n\nTrump will not undergo a psychological evaluation today in spite of a pervasive belief among his critics that's spread to voters that he's unfit to sit in the Oval Office.\n\nThe White House said yesterday that Jackson will release a statement on Trump's health today and provide an in-depth diagnostic update after Trump returns from a three-day holiday.\n\nAfter his physical this afternoon, Trump will leave Washington for Palm Beach, where he'll remain through Martin Luther King Jr. Day.\n\nTrump will honor the civil rights movement hero this morning with a proclamation.\n\nYesterday, Trump predicted his first health checkup by a military physician would go 'very well.' Adding, 'I'll be very surprised if it doesn't.'\n\nThen he quipped: 'It better go well otherwise the stock market will not be happy,' linking his own health to the Wall Street's boom.\n\nAnd in a new demonstration of transparency, Jackson will head to the White House Tuesday to take questions from reporters about the president's health.\n\n'He’ll join me here on Tuesday to give a detailed readout of the president’s exam and then answer a few questions from you guys,' said White House press secretary Sarah Huckabee Sanders at her daily press briefing.\n\nTrump is getting his first medical checkup since taking office, a head-to-toe exam on Friday as questions swirl about the health and fitness of the oldest person ever elected to the nation's highest office.\n\nIn advance, the 71-year-old president has pushed back vigorously against suggestions he's mentally unfit, declaring himself 'a very stable genius.'\n\nThat followed the release of a new book, 'Fire and Fury,' that maintains his close advisors have doubts about his mental fitness for office.\n\nTrump's personal physician, Dr. Harold Bornstein, famously released a letter during the campaign that pronounced Trump to be the healthiest person ever to hold office.\n\n'If elected, Mr. Trump, I can state unequivocally, will be the healthiest individual ever elected to the presidency,' wrote Bornstein, who provided care for Trump for 35 years.\n\n'His health is excellent, especially his mental health,' Bornstein told NBC afterward.\n\nTrump raised concern last month when he slurred some words on national TV. When asked about it, White House press secretary Sarah Huckabee Sanders said questions about Trump's health were 'frankly, pretty ridiculous' and blamed his slurred speech on a dry throat, 'nothing more than that.'\n\nMore questions have been raised in the weeks since, given the tone of some of his tweets and the reported comments of some of the people who deal with him day to day. Some were recently published in a new book about his first year, which Sanders denounced as 'complete fantasy' for its portrayal of Trump as undisciplined, child-like and in over his head.\n\nTrump was 70 when he was inaugurated a year ago to handle the 24/7 demands of being president. Ronald Reagan, who served two terms, was a year younger when he took office in 1981.\n\nTrump took the unusual step of threatening legal action to try to suppress publication of 'Fire and Fury: Inside the Trump White House,' by Michael Wolff. He then drew even more attention to the book and the debate about his fitness with weekend tweets stating that his two greatest assets in life 'have been mental stability and being, like, really smart.' Trump noted his success in business, reality TV and presidential politics, saying: 'I think that would qualify as not smart, but genius ... and a very stable genius at that!'\n\nThe president is to fly by helicopter Friday afternoon to Walter Reed National Military Medical Center outside Washington in Bethesda, Maryland, for the exam.\n\nThere is no requirement for a president to have a physical, but modern officeholders undergo them regularly and release a doctor's report stating that they are 'fit to serve.'\n\nTrump will not undergo a psychiatric exam, the White House said. Officials did not address a different type of screening, assessments of cognitive status that examine neurologic functions including memory. Cognitive assessments aren't routine in standard physicals, although they recently became covered in Medicare's annual wellness visits for seniors.\n\nDr. Ronny L. Jackson, a Navy rear admiral who is the president's official physician and director of the White House Medical Unit, is coordinating the exam. Jackson provided care for President Barack Obama, conducting and supervising the last of three physicals Obama had during his eight years in office.\n\nHow much of Trump's health information the public gets to see is up to him, but Sanders said she expects him to release the same kind of details as past presidents.\n\nIn September 2016, during the presidential campaign, Trump released a five-paragraph letter from Dr. Harold Bornstein, his longtime physician, in which the gastroenterologist concluded that Trump 'is in excellent physical health.' A year earlier, Bornstein said in a December 2015 letter: 'If elected, Mr. Trump, I can state unequivocally, will be the healthiest individual ever elected to the presidency.'\n\nThe 2016 letter put Trump's blood pressure and cholesterol measurements in the healthy range, but he does use a cholesterol-lowering statin medication. His EKG, chest X-ray, echocardiogram and blood sugar were normal. The 6-foot-3 Trump weighed 236 pounds, and his body mass index, or BMI, of 29.5 put him in the category of being overweight for his height.\n\nTrump takes Crestor for his cholesterol, a low-dose aspirin for heart attack prevention, Propecia to treat male-pattern baldness and antibiotics for rosacea. The one-page letter stated Trump's testosterone level, 441.6, was in the normal range, as were his PSA reading for prostate abnormalities and tests of his liver and thyroid.\n\nTrump leads a largely sedentary lifestyle compared to his most recent predecessors, who ran, rode mountain bikes, played basketball or used exercise machines and lifted weights, and were significantly younger than him when they took office. Trump has said he gets most of his exercise from playing golf, which he does most weekends, driving a cart instead of walking from hole to hole.\n\nFederal health guidelines urge people over age 65 who have no health conditions that would limit exercise to get about 2½ hours a week of moderate activity, such as brisk walking, and to do some muscle-strengthening activities at least two days a week.\n\nAs for his diet, Trump enjoys fast food, steaks well-done and with ketchup, chocolate cake and double scoops of vanilla ice cream, and reportedly downs 12 Diet Cokes a day. In a series of interviews last year, Trump showed journalists how he summons a butler to bring him a soda by pressing a red button on his Oval Office desk. In a recent book, 'Let Trump Be Trump,' former top campaign aides Corey Lewandowski and David Bossie described the four major food groups on Trump's campaign plane as 'McDonald's, Kentucky Fried Chicken, pizza and Diet Coke.'\n\nDemocratic Rep. Jamie Raskin of Maryland introduced a bill in April to create a commission that would study whether the president was mentally or physically unable to perform his duties. Democrat Zoe Lofgren of California followed in August with a resolution urging the vice president and Cabinet to have Trump undergo exams to assess his competence. Neither measure has advanced in Congress.\n\nWhite House officials pushed back Monday against a report by the Axios news website that Trump has been starting his official days later and holding fewer meetings than earlier in his presidency. Spokesman Hogan Gidley said Trump 'exhibits yeoman-like work every day in this job, whether it be up before dawn and up into the wee hours of the morning every day.'\n\nOn Tuesday, the White House made a point of opening Trump's lengthy immigration meeting with lawmakers to reporters and TV cameras, a rare public look lasting nearly an hour at the president conducting a policy gathering.\n\nTrump friend Chris Ruddy, head of the conservative news site NewsMax, says he does not know the details of Trump's schedule but 'the idea that he's some sort of absentee president is ludicrous.'\n\nBarbara Perry, director of presidential studies at the University of Virginia's Miller Center, said, 'There's a long history in the presidency of presidents hiding their medical infirmities, both as candidates and as presidents.'\n\nGrover Cleveland secretly had part of a cancerous jaw removed aboard a yacht in 1893 when he was said to be on a fishing trip. During the 1960 election, John F. Kennedy concealed that he suffered from a variety of conditions, including Addison's disease, which he controlled with steroids and other drugs. Woodrow Wilson had a secret stroke.\n\nPerry said, 'In the nuclear age, our lives are in the hands of our presidents. I think the American people should know everything there is to know about a president's mental and physical health.'",
        "summary": {
            "sentences": [
                "Donald Trump will submit himself for his first health checkup as president this afternoon.",
                "Trump is getting his first medical checkup since taking office, a head-to-toe exam on Friday as questions swirl about the health and fitness of the oldest person ever elected to the nation's highest office.",
                "When asked about it, White House press secretary Sarah Huckabee Sanders said questions about Trump's health were 'frankly, pretty ridiculous' and blamed his slurred speech on a dry throat, 'nothing more than that.'",
                "In September 2016, during the presidential campaign, Trump released a five-paragraph letter from Dr. Harold Bornstein, his longtime physician, in which the gastroenterologist concluded that Trump 'is in excellent physical health.'",
                "On Tuesday, the White House made a point of opening Trump's lengthy immigration meeting with lawmakers to reporters and TV cameras, a rare public look lasting nearly an hour at the president conducting a policy gathering."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.464761
            },
            "body": {
                "polarity": "positive",
                "score": 0.92595
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.dailymail.co.uk/news/article-5262975/Trump-gets-presidential-checkup-no-psych-eval.html?ITO=1490&ns_mchannel=rss&ns_campaign=1490",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93605259",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93605259",
            "canonical": null
        }
    },
    {
        "id": 92968413,
        "title": "Severe obesity may be caused by this genetic mutation",
        "body": "What causes obesity? This question continues to puzzle scientists and those living with the condition.\n\nAn increasing amount of studies are helping to remove the social stigma surrounding obesity, pointing to appetite-controlling hormones or even brain cells as potential causes.\n\nSome are also pointing to genetic mutations as potential culprits for the condition. For example, Medical News Today have recently reported on a study in which mice gained weight without eating more as a result of having a certain gene variant. This made the researchers refer to the phenomenon as \"fault-free obesity.\"\n\nAnother previous study — led by Prof. Philippe Froguel, who is chair of genomic medicine at Imperial College London (ICL) in the United Kingdom — found that variants in three genes accounted for 30 percent of the severe obesity cases identified in a Pakistani population.\n\nThe same team of ICL researchers have now chosen to focus on a group of Pakistani children with extreme obesity from consanguineous families, or those that descend from the same ancestor, in an attempt to single out a specific gene mutation.\n\nAs the authors of the new study explain, so-called recessive mutations are responsible for the link between obesity and genes. Recessive inheritance occurs when both copies of the gene — that is, from both parents — have the mutation, and this is more likely to occur when a child's parents are closely related.\n\nSo, Prof. Froguel and colleagues used genome sequencing in Pakistani children because people in this region are more likely to form consanguineous marriages, and the resulting children are more likely to have recessive mutations.\n\nThe new study — which was recently published in the journal Nature Genetics — suggests that mutations in a gene called adenylate cyclase 3 (ADCY3) lead to obesity.\n\nAccording to the authors, mutations in this gene — which is normally responsible for encoding the protein of the same name — causes changes in functions such as appetite regulation and the olfactory sense.\n\nAs Prof. Froguel explains, \"Early studies into ADCY3 tested mice that were bred to lack that gene, found that these animals were obese and also lacked the ability to smell, known as anosmia.\"\n\nAs expected, they found the same ADCY3 mutation in children. Also, as Prof. Froguel explains, \"When we tested our patients, we found that they also had anosmia, again showing a link to mutations in ADCY3.\"\n\nAdditionally, using the GeneMatcher website, Prof. Froguel and colleagues found another patient — this time of European-American descent — who had inherited different ADCY3 mutations from both parents and who also had obesity.\n\nTogether, the study authors conclude, \"These findings highlight ADCY3 as an important mediator of energy homeostasis and an attractive pharmacological target in the treatment of obesity.\"\n\nKnowing precisely which genetic mutations lead to obesity will enable researchers to come up with drugs that target these mutations specifically, the authors explain.",
        "summary": {
            "sentences": [
                "Another previous study — led by Prof. Philippe Froguel, who is chair of genomic medicine at Imperial College London (ICL) in the United Kingdom — found that variants in three genes accounted for 30 percent of the severe obesity cases identified in a Pakistani population.",
                "The same team of ICL researchers have now chosen to focus on a group of Pakistani children with extreme obesity from consanguineous families, or those that descend from the same ancestor, in an attempt to single out a specific gene mutation.",
                "As the authors of the new study explain, so-called recessive mutations are responsible for the link between obesity and genes.",
                "The new study — which was recently published in the journal Nature Genetics — suggests that mutations in a gene called adenylate cyclase 3 (ADCY3) lead to obesity.",
                "Additionally, using the GeneMatcher website, Prof. Froguel and colleagues found another patient — this time of European-American descent — who had inherited different ADCY3 mutations from both parents and who also had obesity."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.761211
            },
            "body": {
                "polarity": "neutral",
                "score": 0.630029
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.medicalnewstoday.com/articles/320572.php",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=92968413",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=92968413",
            "canonical": null
        }
    },
    {
        "id": 93399765,
        "title": "Judge sends man charged in train shooting to senior facility",
        "body": "WHEATON, Ill. (AP) — A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.The (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness. Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville. Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder.———Information from: Daily Herald, http://www.dailyherald.com\n                                \n        \n        \n                            \n                            \n                           \n\n                            \n                                Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
        "summary": {
            "sentences": [
                "WHEATON, Ill. (AP) — A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.The (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness.",
                "Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville.",
                "Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip.",
                "Case was shot in the abdomen.Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.496248
            },
            "body": {
                "polarity": "neutral",
                "score": 0.981061
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.roanoke.com/news/virginia/wire/judge-sends-man-charged-in-train-shooting-to-senior-facility/article_82fc9971-eaa4-5094-bba3-538acff46b20.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93399765",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93399765",
            "canonical": null
        }
    },
    {
        "id": 93397245,
        "title": "Judge sends man charged in train shooting to senior facility",
        "body": "WHEATON, Ill. (AP) — A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.\n\nThe (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness. Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.\n\nKlein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville. Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.\n\nDoctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder.",
        "summary": {
            "sentences": [
                "WHEATON, Ill. (AP) — A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.",
                "Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.",
                "Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville.",
                "Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.496248
            },
            "body": {
                "polarity": "positive",
                "score": 0.639151
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.seattletimes.com/nation-world/judge-sends-man-charged-in-train-shooting-to-senior-facility/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93397245",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93397245",
            "canonical": null
        }
    },
    {
        "id": 93402795,
        "title": "Amtrak passenger charged in conductor shooting found unfit to stand trial",
        "body": "A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.The (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness. Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville. Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder.",
        "summary": {
            "sentences": [
                "A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.The (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness.",
                "Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville.",
                "Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip.",
                "Case was shot in the abdomen Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.492234
            },
            "body": {
                "polarity": "positive",
                "score": 0.608965
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://abc7chicago.com/amtrak-passenger-charged-in-conductor-shooting-found-unfit-to-stand-trial/2929647/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93402795",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93402795",
            "canonical": null
        }
    },
    {
        "id": 93400271,
        "title": "Judge sends man charged in train shooting to senior facility",
        "body": "WHEATON, Ill. (AP) - A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.                The (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness. Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville. Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder.___Information from: Daily Herald, http://www.dailyherald.com\n                 LOAD COMMENTS ()\n              HIDE COMMENTS",
        "summary": {
            "sentences": [
                "WHEATON, Ill. (AP) - A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.",
                "Klein will go to a Wauwatosa, Wisconsin, facility that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.Klein, of West Allis, Wisconsin, has been held on $1.5 million bail in the shooting last May in Naperville.",
                "Conductor Michael Case has testified that Klein was disoriented and frustrated during the trip.",
                "Case was shot in the abdomen.Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.496248
            },
            "body": {
                "polarity": "neutral",
                "score": 0.827846
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.washingtontimes.com/news/2018/jan/11/judge-sends-man-charged-in-train-shooting-to-senio/?utm_source=RSS_Feed&utm_medium=RSS",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93400271",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93400271",
            "canonical": null
        }
    },
    {
        "id": 93446634,
        "title": "Judge sends man charged in train shooting to senior facility",
        "body": "WHEATON, Ill. (AP) — A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.\n    Klein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.Klein has been held on $1.5 million bail since the shooting in Naperville. Conductor Michael Case testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.\n    \n    Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder. He's from West Allis, Wisconsin.\n                                \n                            \n                            \n                           \n\n                            \n                                Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
        "summary": {
            "sentences": [
                "WHEATON, Ill. (AP) — A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.",
                "Klein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.Klein has been held on $1.5 million bail since the shooting in Naperville.",
                "Conductor Michael Case testified that Klein was disoriented and frustrated during the trip.",
                "Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.496248
            },
            "body": {
                "polarity": "negative",
                "score": 0.582987
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://billingsgazette.com/news/national/judge-sends-man-charged-in-train-shooting-to-senior-facility/article_f92bcc05-94ab-5786-a363-96a985ff243d.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93446634",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93446634",
            "canonical": null
        }
    },
    {
        "id": 93525351,
        "title": "Why Trump Thinks Kim Jong-un, Who Called Him a ‘Dotard,’ Might Be His Friend",
        "body": "President Trump sat down for a 45-minute interview with The Wall Street Journal on Thursday, which, unsurprisingly, yielded many bizarre comments that are meant to be taken seriously, but not literally. (We hope. When asked about the future of his relationship with Steve Bannon, he said, “I don’t know what the word permanent means.”)\n\nThe most puzzling remarks concerned North Korean dictator Kim Jong-un. “I probably have a very good relationship with Kim Jong-un,” Trump told the paper. “I have relationships with people. I think you people are surprised.”\n\nIndeed, people were surprised, and not just at the fact that Trump has connections of some nature with other human beings. Trump has dubbed the North Korean leader “Rocket Man,” and called him a “maniac,” a “madman,” a “bad dude,” and a “sick puppy.” In November he mocked his looks, suggesting he’s “short and fat,” and ten days ago he declared his “nuclear button” is “much bigger & more powerful one than his, and my Button works!” In addition to threatening the U.S. with nuclear annihilation on numerous occasions, Kim has gone after Trump personally as well, vowing in September to “tame the mentally deranged U.S. dotard with fire.”\n\nSo why did Trump suggest he and Kim might be pals now? Here are some theories.\n\n1) Trump talked to Kim and they patched things up. \n\nTrump’s remarks suggested a turnaround so startling that the Journal asked if the president has had some communications with the dictator that the world is not aware of. Trump offered this cryptic reply: “I don’t want to comment on it. I’m not saying I have or haven’t. I just don’t want to comment.”\n\nThe U.S. has not had formal talks with North Korea in a decade. In May Trump said he would be “honored” to meet with Kim, and Secretary of State Rex Tillerson has indicated that there are back channel discussions between the two countries, saying, “We have lines of communication to Pyongyang — we’re not in a dark situation, a blackout.”\n\nBut in all likelihood, Trump did not pick up the phone and give Kim a call. When asked if the president has spoken to the dictator, a senior administration official told CNN, “That’s not something we would discuss but we are not aware this contact has occurred.”\n\n2) Trump is signaling that he’s willing to negotiate.\n\nTrump’s remarks were published under the headline “Donald Trump Signals Openness to North Korea Diplomacy in Interview,” which gives the impression that they were part of some coherent strategy.\n\nIt’s possible Trump is trying to send the message that he embraces North Korea’s new attempts at diplomacy. After Kim expressed a desire for “peaceful resolution with our southern border” in his New Year’s address, the two sides engaged in talks for the first time in years.\n\nTrump said he thinks it’s good that North Korea will be participating in the upcoming Olympic games in South Korea, and that U.S.-South Korea military exercises have been postponed until after the games. But he acknowledged suspicions that North Korea is just trying to drive a wedge between the U.S. and its ally South Korea.\n\n“If I were them, I would try,” Trump said. “The difference is I’m president, other people aren’t,” he added. “And I know more about wedges than any human being that’s lived.”\n\n3) Some of his best friends are his bitter enemies.\n\nLater in the interview, Trump suggested that even if he and Kim don’t have a great relationship right now, that may change very soon. Not because they’ve talked, or because that’s the new U.S. strategy – that’s just the strange nature of being friends with Trump.\n\n“You’ll see that a lot with me,” he said of his mean tweets, “and then all of the sudden somebody’s my best friend. I could give you 20 examples. You could give me 30. I’m a very flexible person.”\n\nTo give just one example, during the campaign, Trump branded his opponent Senator Ted Cruz as “Lyin’ Ted,” questioned his citizenship, threatened to “spill the beans” on his wife, suggested she’s ugly, and insinuated that his father may have helped killed JFK. Cruz ultimately decided to endorse Trump, and now he attacks other Republicans for their disloyalty to the president.\n\nPresident Trump and Rocket Man will be admiring the size of each other’s nukes in no time.",
        "summary": {
            "sentences": [
                "“I probably have a very good relationship with Kim Jong-un,” Trump told the paper.",
                "Trump’s remarks were published under the headline “Donald Trump Signals Openness to North Korea Diplomacy in Interview,” which gives the impression that they were part of some coherent strategy.",
                "It’s possible Trump is trying to send the message that he embraces North Korea’s new attempts at diplomacy.",
                "Later in the interview, Trump suggested that even if he and Kim don’t have a great relationship right now, that may change very soon.",
                "Not because they’ve talked, or because that’s the new U.S. strategy – that’s just the strange nature of being friends with Trump."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.576549
            },
            "body": {
                "polarity": "positive",
                "score": 0.896977
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://nymag.com/daily/intelligencer/2018/01/trump-thinks-kim-who-called-him-dotard-might-be-a-friend.html?utm_source=nym&utm_medium=f1&utm_campaign=feed-part",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93525351",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93525351",
            "canonical": null
        }
    },
    {
        "id": 93432263,
        "title": "Judge sends man charged in train shooting to senior facility",
        "body": "WHEATON, Ill. (AP) -- A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.\n\nThe (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness.\n\nKlein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.\n\nKlein has been held on $1.5 million bail since the shooting in Naperville. Conductor Michael Case testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.\n\nDoctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder. He's from West Allis, Wisconsin.",
        "summary": {
            "sentences": [
                "Klein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.",
                "Klein has been held on $1.5 million bail since the shooting in Naperville.",
                "Conductor Michael Case testified that Klein was disoriented and frustrated during the trip.",
                "Doctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.496248
            },
            "body": {
                "polarity": "negative",
                "score": 0.410654
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://hosted.ap.org/dynamic/stories/U/US_AMTRAK_CONDUCTOR_SHOT?SITE=WICHP&SECTION=HOME&TEMPLATE=DEFAULT",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93432263",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93432263",
            "canonical": null
        }
    },
    {
        "id": 93432797,
        "title": "Judge sends man charged in train shooting to senior facility | Metro News",
        "body": "WHEATON, Ill. â\u0080\u0094 A Wisconsin man who was found mentally unfit to stand trial for the May shooting of an Amtrak conductor outside Chicago will be released to a secure senior living facility.\n\n\nThe (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness.\n\n\nKlein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia. Klein is prohibited from leaving the facility except for an emergency.\n\n\nKlein has been held on $1.5 million bail since the shooting in Naperville. Conductor Michael Case testified that Klein was disoriented and frustrated during the trip. Case was shot in the abdomen.\n\n\nDoctors have diagnosed Klein with an impaired cognition disorder, dementia and neuro-cognitive disorder. He's from West Allis, Wisconsin.\n\n\n\nInformation from: Daily Herald, http://www.dailyherald.com",
        "summary": {
            "sentences": [
                "The (Arlington Heights) Daily Herald reports that an Illinois judge on Wednesday said he doubted 80-year-old Edward Klein would be restored to fitness.",
                "Klein will be sent to a facility in Wauwatosa, Wisconsin, that specializes in care for patients with dementia.",
                "Klein is prohibited from leaving the facility except for an emergency.",
                "Klein has been held on $1.5 million bail since the shooting in Naperville.",
                "Conductor Michael Case testified that Klein was disoriented and frustrated during the trip."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.486052
            },
            "body": {
                "polarity": "neutral",
                "score": 0.989149
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.metronews.ca/news/world/2018/01/11/judge-sends-man-charged-in-train-shooting-to-senior-facility.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93432797",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93432797",
            "canonical": null
        }
    }
]