[
    {
        "id": 93556360,
        "title": "Trump’s brain, a national problem",
        "body": "I am the editor of “The Dangerous Case of Donald Trump: 27 Psychiatrists and Mental Health Experts Assess a President.” I, along with thousands of other mental health professionals, believe in our expert opinion that Donald Trump, in the office of the presidency, is a risk to national and international security.\n\nThis is not a diagnosis. It is an attempt to educate the nation about what we strongly believe to be true, so that the public can demand an objective evaluation of Trump’s mental capacity. A capacity exam doesn’t decide who can or cannot be President; it ensures that whoever is President is capable of carrying out the vital functions the people elected him to carry out.\n\nEverywhere I go, I am assumed to be a Democrat, just for issuing a warning about a President who happens to be Republican. I have never been a Democrat and have no desire to become one. I would behave identically regarding a Democratic President with the same objective signs.\n\nI am a physician and forensic psychiatrist who has been invited many times to testify for state and international governments about violence prevention. Never has it occurred to me to consider which party I was testifying for.\n\nMy primary concern is with enhancing life and reducing death. Health and disease are not difficult to tell apart: One leads to flourishing and life, regardless of ideology or party, while the other leads to damage, destruction and death.\n\nYet sadly, my words have been drawn into the cauldron of politics. In recent months, since my first public warnings about the President’s dangerousness due to mental instability, various lawmakers reached out to me.\n\nAs an influential former Congress member took steps to arrange for me, eventually, to testify before all of Congress, I prepared testimony.\n\nHowever, with time, the resistance of Republican lawmakers became obvious. The testimony before a bipartisan committee has not happened and is not likely to. While it kept being postponed, an impatient former assistant U.S. attorney and former prosecutor drew on her own contacts and arranged for me to meet with 11 members of Congress privately.\n\nThey were all Democrats. No matter how hard she tried, Republican lawmakers’ doors remained shut.\n\nMeanwhile, while I was on Capitol Hill, several laypeople, previously unknown to me, were on a campaign to deliver a copy of our book to every member of Congress. The attorney coordinating this used her contacts to have me meet with key Republican staffers that day in a half-dozen offices.\n\nIt was by happenstance that we ran into one Republican senator, who was returning to the office where I had already met with staffers. Upon hearing the topic, the effort not to engage was palpable.\n\nContrast this to the Democratic lawmakers: They would not have minded meeting in a large group, and three of the offices have even released their names to the press.\n\n“You don’t have to convince us; we have been so concerned ourselves, we were eager to meet with you,” was a common answer. One lawmaker said: “I have never so waited for a meeting in 11 years!”\n\nConcern, they said, was universal among Democrats. Several said they knew of Republican lawmakers who shared their concerns, perhaps equally, but could not express it.\n\nThis discovery was troubling: If bipartisan concern about the President’s mental capacity is real, yet some members of Congress are stifling their worries for political reasons, then what does that say about our nation’s security?\n\nDemocratic lawmakers charged us instead: “Keep doing what you are doing: Educate the public! We ourselves cannot do anything without the public’s support.” And so, I began actively interviewing with the media.\n\nAlong the way, I experienced firsthand an even more troubling phenomenon: the push to mischaracterize my words to grind an ideological ax.\n\nIn one instance, I picked up a phone call to speak with a reporter at an outlet unknown to me. I agreed to the interview, which was hostile from the start. Out of it came a wildly speculative article built around assumptions and associations — for instance, contorting taking my respect for confidentiality as a courtesy to Republicans as something secretive and subversive.\n\nMy life’s work is understanding the human mind as best as I can, the better to prevent people from physical harm. That is my sole objective in seeking independent psychiatric evaluation of the President.\n\nWhenever there is a sickness, in the body or the mind or the body politic, there is a countering force that “kicks in” — an immune reaction, if you will — that fights for the recovery of health. In the midst of an uphill battle, I hope that the lawmakers who have found it hard to do so will find the courage to join that impetus and to fulfill their duty to protect us.",
        "summary": {
            "sentences": [
                "I am the editor of “The Dangerous Case of Donald Trump: 27 Psychiatrists and Mental Health Experts Assess a President.”",
                "I, along with thousands of other mental health professionals, believe in our expert opinion that Donald Trump, in the office of the presidency, is a risk to national and international security.",
                "In recent months, since my first public warnings about the President’s dangerousness due to mental instability, various lawmakers reached out to me.",
                "Several said they knew of Republican lawmakers who shared their concerns, perhaps equally, but could not express it.",
                "This discovery was troubling: If bipartisan concern about the President’s mental capacity is real, yet some members of Congress are stifling their worries for political reasons, then what does that say about our nation’s security?"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.513817
            },
            "body": {
                "polarity": "negative",
                "score": 0.762506
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://feeds.nydailynews.com/~r/nydnrss/lifestyle/education/~3/4fF88uu29Hg/trump-brain-national-problem-article-1.3752078",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93556360",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93556360",
            "canonical": "http://www.nydailynews.com/opinion/trump-brain-national-problem-article-1.3752078"
        }
    },
    {
        "id": 93169176,
        "title": "The problem isn't Trump's brain. It's his heart",
        "body": "Michael D'Antonio is the author of \" Never Enough: Donald Trump and the Pursuit of Success \" (St. Martin's Press). The opinions expressed in this commentary are his.\n\n(CNN) During an hourlong performance Tuesday at a table crowded with lawmakers -- let's call it The President Show -- Donald Trump appeared determined to prove two things. The first was obvious: After much speculation about his temperament, inspired by the dark portrait painted in the book \"Fire and Fury,\" he no doubt wanted to show himself to be an executive in command of the issues and fit to govern. The second was that he is a good man with a warm heart.\n\nIn Trump's eyes, the meeting was a huge success. On Wednesday, he said at his first Cabinet meeting of 2018, that the session a day earlier was a \"tremendous meeting\" and that it got \"great reviews.\"\n\nIn truth, in the role of executive, Trump should get three out of five stars because he spoke calmly and didn't insult anyone.\n\nHowever he showed little understanding of the immigration issues he was supposed to discuss and seemed to abandon his own bargaining position. He even embraced the role of a figurehead who would do whatever Congress dictates as he promised that, if \"this group and others from the Senate, from the House, comes back with an agreement, I'm signing it.\"\n\nTrump's turn in the role as good-hearted man was marked by lines like, \"Truly, it should be a bill of love, and we can do that.\" He was referring to devising a plan that would protect from deportation 800,000 young immigrants who live under the Deferred Action for Childhood Arrivals (DACA) program.\n\nWhat he didn't say was that he personally set in motion the cruel policy that would begin their deportation in March, and that he campaigned for president by repeating anti-immigrant slurs that tapped into prejudice with dangerous results -- as in the case of two brothers who attacked a Latino man in Boston, with one of them later telling police, \"Donald Trump was right, all these illegals need to be deported.\"\n\nThe word \"love\", as voiced by Donald Trump, has a strange tone. It's like listening to a first-day student repeat after the instructor in a foreign language class. You recognize the words, but not the feeling behind them.\n\nHe sounded similarly off-key last autumn when he talked about how he \"loved\" Puerto Rico when he visited after Hurricane Maria. In fact he met few actual victims of the storm and his administration's response to the island's needs lacked the energy (read \"love\") shown for the people of Texas and Florida in similar circumstances.\n\nSimilarly, a President who has said he loves \"all the people of our country\" has proven to be a most divisive figure, picking winners and losers in everything from tax policy (sorry residents of Democratic-leaning \"Blue\" states) to civil rights issues. He loudly imagined talking about a generic protesting athlete as a \"son of a bitch.\"And, quite bizarrely, Trump followed up his many acid remarks about US intelligence agencies by telling people at the Central Intelligence Agency , \"I just wanted to really say that I love you, I respect you.\"\n\nAltogether, Trump's attempt at self-revealing comments, whether he's voicing the love in his heart for some people, or his hatred for others, like protesters and members of the press, depict a man whose emotional declarations seem manipulative, staged, and hollow.\n\nHis most authentic expressions of feeling seem to come when he's angry or mocking. In those moments, it's easy to hear that he means what he says. However when he tries to show warmth, he is far less convincing and his motivations are transparent.\n\nWhen he visited the CIA at the start of his presidency Trump was trying to repair the damage done as he denigrated intelligence agencies and faced the prospect of trying to carry out policy with a bureaucracy he had savaged. His expressions of concern for the DACA \"dreamers\" comes as much of America worries about the fate of these young people and their deportation looms as a remarkable act of heartlessness.\n\nBesides a general desire to be seen as more humane, Trump hinted Tuesday at another reason why he would want to appear warmer and more congenial. This he revealed when asked about the potential presidential candidacy of media-mogul Oprah Winfrey, who sparked talk of a run with a speech at the Golden Globes awards ceremony. In that speech, Winfrey hit many of the themes Barack Obama struck when he burst on the national scene in 2004 and she inspired a viral #Oprah2020 online movement.\n\nTrump came alive when asked about Oprah's potential, saying, \"I know her very well. You know I did one of her last shows. She had Donald Trump -- this is before politics -- her last week. And she had Donald Trump and my family. It was very nice. No, I like Oprah. I don't think she's going to run. I don't think she's going to run. I know her very well.\"\n\nWhat Trump knows about Oprah is that after decades of a five-days-a-week national talk show and dozens of movie and TV roles that resonated with feeling, Oprah, one of the most famous women in the world, is known for her authenticity and warmth. No one has revealed his or her heart to greater effect and, along the way, she has made emotional honesty possible for public figures.\n\nRecall Oprah talking about her trouble in childhood, her struggles in love, or even her effort to manage her weight and you are recalling the deeds of a woman who taught America how to speak from the heart. In the process, she demonstrated that her own heart is full, strong, and open in ways that Trump cannot match. The President surely understands the power of Oprah's emotional authenticity and it was this understanding that prompted his own effort to show warmth toward the DACA dreamers.\n\nThe trouble for Trump is that he has spent a lifetime showing the world that love and compassion are not his strengths. Whether he was trying to evict people from an apartment building he bought in New York or encouraging people to rough up protesters at his rally, Trump has shown that his true emotional nature is cold, not warm, cramped, not expansive.\n\nWith Oprah and her abundant love looming on the political horizon, Trump seems to have intuited that he needs to show a little kindness himself. If he wants the audience, or rather, the country, to buy his performance, he'll need to cultivate some of the real thing.",
        "summary": {
            "sentences": [
                "(CNN) During an hourlong performance Tuesday at a table crowded with lawmakers -- let's call it The President Show -- Donald Trump appeared determined to prove two things.",
                "What he didn't say was that he personally set in motion the cruel policy that would begin their deportation in March, and that he campaigned for president by repeating anti-immigrant slurs that tapped into prejudice with dangerous results -- as in the case of two brothers who attacked a Latino man in Boston, with one of them later telling police, \"Donald Trump was right, all these illegals need to be deported.\"",
                "Altogether, Trump's attempt at self-revealing comments, whether he's voicing the love in his heart for some people, or his hatred for others, like protesters and members of the press, depict a man whose emotional declarations seem manipulative, staged, and hollow.",
                "What Trump knows about Oprah is that after decades of a five-days-a-week national talk show and dozens of movie and TV roles that resonated with feeling, Oprah, one of the most famous women in the world, is known for her authenticity and warmth.",
                "With Oprah and her abundant love looming on the political horizon, Trump seems to have intuited that he needs to show a little kindness himself."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.929666
            },
            "body": {
                "polarity": "positive",
                "score": 0.730118
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://rss.cnn.com/~r/rss/cnn_latest/~3/O4fq0FkPyBY/index.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93169176",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93169176",
            "canonical": "http://www.cnn.com/2018/01/10/opinions/the-problem-isnt-trumps-brain-but-his-heart-opinion-dantonio/index.html"
        }
    },
    {
        "id": 93186277,
        "title": "Turns out Bannon was Trump’s brain",
        "body": "In order to prove he doesn’t have dementia, as alleged in a recent book, President Trump called a meeting with congressional leaders on Tuesday – and requested that it be televised.\nIvanka: Show them at your best, Daddy!\nHe then proceeded to completely sell out the base and actually added to his problems by appearing senile.\nIn a half-dozen exchanges – which, again, he wanted televised – Trump responded to remarks as if he had no clue what the person was saying. One senator would talk – he’d agree. Someone else would say the exact opposite – he’d agree with that, too.\nActual exchange:\nSEN. DIANNE FEINSTEIN: “What about a clean DACA bill now, with a commitment that we go into a comprehensive immigration reform procedure? …”\nTRUMP: “… I have no problem. … We’re going to come up with DACA. We’re going to do DACA, and then we can start immediately on the phase two, which would be comprehensive.”\nSEN. FEINSTEIN: “Would you be agreeable to that?”\nTRUMP: “I think a lot of people would like to see that, but I think we have to do DACA first.”\nREP. KEVIN MCCARTHY: “Mr. President, you need to be clear, though. I think what Sen. Feinstein is asking here: When we talk about just DACA, we don’t want to be back here two years later. You have to have security, as the secretary would tell you.”\nTRUMP: “But I think that’s what she’s saying.”\nREP. MCCARTHY: “No, no, I think she’s saying something different. …”\nTRUMP: “I do believe that. Because once we get DACA done – if it’s done properly – with, you know, security and everything else …”\nTrump was more than willing to sell out the base to solve a personal problem of his – the Michael Wolff book – but managed not to convince a single American that he’s articulate, bright or a good leader.\nOn MSNBC, the hosts didn’t say, “You know, we saw a new side of Trump today …” Instead, they could barely suppress their giggles over the great negotiator being rolled.\nThe Democrats’ opening bid is: Not only does every poor person in the world get to come live here, but all their relatives get to come, too!\nThey don’t control any branch of government, and they’re not budging from that.\nTrump’s counter-offer is: OK! My immigration policy is whatever you send me!\nThe end result was: On the left, they’re happy, but still think Trump’s a moron. On the right, they’re unhappy, and also think Trump’s a moron.\nThe people who do not realize Tuesday was the lowest moment of the Trump presidency have no idea what they’re talking about. The headline on Trump’s sit-down could have been:\n“TRUMP ANNOUNCES SAME FAILED AMNESTY DEAL WE HAD 30 YEARS AGO”\nThe media have done such a fantastic job lying to the public that no one knows that.\nTo the average viewer, it sounds like a totally fair deal. We give only the BEST illegals a “pathway” to citizenship, they’ll have to jump through all sorts of hoops, and in return, we’ll get REAL security.\nThat’s exactly what we were promised the last time. What we got: No hoops, no security, and everyone got amnesty.\nYou don’t need chain migration for the alleged 800,000 “Dreamers” to swell to 60 million – or 100 or 200 million. First, there are already at least 50 million illegals (aka Dreamers) living here. (For more, see “Adios, America,” pp. 72-74.)\nSecond, ANY amnesty means there will be lawsuits, whereupon the courts will grant amnesty to everyone. All of Latin America, including Latin Americans still living in Latin America, can mosey up sometime in the next 20 years, present themselves to a 9th Circuit judge and claim they were brought here as children.\nHOW CAN PEOPLE BROUGHT HERE AS CHILDREN BE EXPECTED TO PROVE IT?\nApplication approved! \nHow do I know this? Because that’s how the 1986 amnesty worked.\nThe 9th Circuit was still approving applications under the 1986 amnesty in 2007 – i.e., 20 years later – from applicants who claimed it wasn’t fair that they weren’t in the country at the time to apply for amnesty.\nThe 1986 law was also loaded with all sorts of requirements on the illegals. We’d be getting only the best! As Trump said on Tuesday, “It’s an incentive for people to do a good job, if you want to know the truth. That whole path is an incentive for people.”\nResult of requirements placed on illegals in the 1986 amnesty:\nEnglish-language requirement – dropped by the INS.\nFines – dropped by the INS.\nFees – waived by the INS.\nBack taxes – dropped by the IRS.\nCongress could pass a law giving amnesty ONLY to left-handed Ph.D.’s in nuclear physics, and everyone would get amnesty. Even illegals who haven’t arrived yet.\nIf there is a silver lining, it’s that this isn’t the first time Trump has sold out the base. He did it in the March 2016 GOP debate; in his “Hannity” interview in August 2016; in the meeting with tech leaders at Trump Tower in December 2016; and in his meeting with Nancy Pelosi and Chuck Schumer last year.\nBut it’s now nearly Trump’s second year in office, we don’t have a wall, and he just called a meeting to say, over and over again: “We have to do DACA first.”\nAt this point, any sentient person has to see that the most plausible scenario is:\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nShe moved the football.",
        "summary": {
            "sentences": [
                "In a half-dozen exchanges – which, again, he wanted televised – Trump responded to remarks as if he had no clue what the person was saying.",
                "Because once we get DACA done – if it’s done properly – with, you know, security and everything else …”\nTrump was more than willing to sell out the base to solve a personal problem of his – the Michael Wolff book – but managed not to convince a single American that he’s articulate, bright or a good leader.",
                "The headline on Trump’s sit-down could have been:\n“TRUMP ANNOUNCES SAME FAILED AMNESTY DEAL WE HAD 30 YEARS AGO”\nThe media have done such a fantastic job lying to the public that no one knows that.",
                "He did it in the March 2016 GOP debate; in his “Hannity” interview in August 2016; in the meeting with tech leaders at Trump Tower in December 2016; and in his meeting with Nancy Pelosi and Chuck Schumer last year.",
                "But it’s now nearly Trump’s second year in office, we don’t have a wall, and he just called a meeting to say, over and over again: “We have to do DACA first.”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.487884
            },
            "body": {
                "polarity": "positive",
                "score": 0.428457
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.wnd.com/2018/01/turns-out-bannon-was-trumps-brain/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93186277",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93186277",
            "canonical": null
        }
    },
    {
        "id": 93210959,
        "title": "Rachel Maddow Torches Trump For 'Pouring Gasoline' On The Russia National Security Threat",
        "body": "Rachel Maddow torched Donald Trump on Wednesday, saying under his poor leadership the United States is one of the few countries in the world not taking the threat of Russia seriously.\n\nMaddow said Trump isn’t just asleep at the wheel when it comes to dealing with the possibility of future Russia attacks, but he’s pouring gasoline on the problem.\n\nMaddow laid out all the ways our allies have been fighting the threat of Russia and explained how dangerous the poor U.S. response is for future elections:\n\nMeanwhile, our government is closing the sanctions office and thinking what else to stick in a goody bag for Vladimir Putin. Top Democrat on the foreign relations committee issued a report on what doing in Europe. Ben Carden commissioned this exhaustive look at the threat posed by Putin and action taken across the world to defend against it. With some positive results even though comparative inaction from our government in the U.S., not seen spending money that Congress said should be spent to counter the disinformation. If you have seen coverage, pull quote is that no president ever before has ignored a national security threat like this one. But think, having read the report, it’s worth noting that not only is our president not leading us to do the kinds of things other countries have been trying to do to put out the fire, in some ways our government has been pouring on gasoline and helping this thing burn.\n\nIt’s long been known that Russia was working tirelessly to help Donald Trump defeat Hillary Clinton during the 2016 campaign. The president still likes to cast doubt on that reality, but it’s widely accepted by the U.S. intelligence community, and any casual observer with a semi-functioning brain.\n\nOver the past year, though, it’s become increasingly clear why Moscow was so adamant to have Trump in the White House: Because he is exactly the kind of Putin puppet that Clinton repeatedly warned voters he would be. The president’s repeated efforts to appease and ignore Russia, despite their constant aggression, are just further confirmation of that reality.\n\nAs Rachel Maddow said on Wednesday, Donald Trump hasn’t just let Russia get away with an attack on U.S. democracy – he’s essentially encouraging the next attack, too.",
        "summary": {
            "sentences": [
                "Rachel Maddow torched Donald Trump on Wednesday, saying under his poor leadership the United States is one of the few countries in the world not taking the threat of Russia seriously.",
                "Maddow said Trump isn’t just asleep at the wheel when it comes to dealing with the possibility of future Russia attacks, but he’s pouring gasoline on the problem.",
                "Maddow laid out all the ways our allies have been fighting the threat of Russia and explained how dangerous the poor U.S. response is for future elections:\n\nMeanwhile, our government is closing the sanctions office and thinking what else to stick in a goody bag for Vladimir Putin.",
                "It’s long been known that Russia was working tirelessly to help Donald Trump defeat Hillary Clinton during the 2016 campaign.",
                "As Rachel Maddow said on Wednesday, Donald Trump hasn’t just let Russia get away with an attack on U.S. democracy – he’s essentially encouraging the next attack, too."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.734106
            },
            "body": {
                "polarity": "negative",
                "score": 0.997956
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.politicususa.com/2018/01/10/rachel-maddow-torches-trump-pouring-gasoline-russia-national-security-threat.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93210959",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93210959",
            "canonical": null
        }
    },
    {
        "id": 93170941,
        "title": "COULTER: It Turns Out Bannon Was Trump’s Brain",
        "body": "In order to prove he doesn’t have dementia, as alleged in a recent book, President Trump called a meeting with congressional leaders on Tuesday — and requested that it be televised.\nIvanka: Show them at your best, Daddy!\nHe then proceeded to completely sell out the base and actually added to his problems by appearing senile.\nIn a half-dozen exchanges — which, again, he wanted televised — Trump responded to remarks as if he had no clue what the person was saying. One senator would talk — he’d agree. Someone else would say the exact opposite — he’d agree with that, too.\n\n\n\n\nActual exchange:\nSEN. DIANNE FEINSTEIN: “What about a clean DACA bill now, with a commitment that we go into a comprehensive immigration reform procedure? …”\nTRUMP: “… I have no problem. … We’re going to come up with DACA. We’re going to do DACA, and then we can start immediately on the phase two, which would be comprehensive.”\nSEN. FEINSTEIN: “Would you be agreeable to that?”\n\n\n\nTRUMP: “I think a lot of people would like to see that, but I think we have to do DACA first.”\nREP. KEVIN MCCARTHY: “Mr. President, you need to be clear though. I think what Sen. Feinstein is asking here: When we talk about just DACA, we don’t want to be back here two years later. You have to have security, as the secretary would tell you.”\nTRUMP: “But I think that’s what she’s saying.”\nREP. MCCARTHY: “No, no, I think she’s saying something different. …”\nTRUMP: “I do believe that. Because once we get DACA done — if it’s done properly — with, you know, security and everything else …”\nTrump was more than willing to sell out the base to solve a personal problem of his — the Michael Wolff book — but managed to not convince a single American that he’s articulate, bright or a good leader.\nOn MSNBC, the hosts didn’t say, “You know, we saw a new side of Trump today …” Instead, they could barely suppress their giggles over the great negotiator being rolled.\nThe Democrats’ opening bid is: Not only does every poor person in the world get to come live here, but all their relatives get to come, too!\nThey don’t control any branch of government, and they’re not budging from that.\nTrump’s counter-offer is: OK! My immigration policy is whatever you send me!\nThe end result was: On the left, they’re happy, but still think Trump’s a moron. On the right, they’re unhappy, and also think Trump’s a moron.\nThe people who do not realize Tuesday was the lowest moment of the Trump presidency have no idea what they’re talking about. The headline on Trump’s sit-down could have been:\n“TRUMP ANNOUNCES SAME FAILED AMNESTY DEAL WE HAD 30 YEARS AGO”\nThe media have done such a fantastic job lying to the public that no one knows that.\nTo the average viewer, it sounds like a totally fair deal. We give only the BEST illegals a “pathway” to citizenship, they’ll have to jump through all sorts of hoops, and in return, we’ll get REAL security.\nThat’s exactly what we were promised the last time. What we got: No hoops, no security and everyone got amnesty.\nYou don’t need chain migration for the alleged 800,000 “Dreamers” to swell to 60 million — or 100 or 200 million. First, there are already at least 50 million illegals (aka Dreamers) living here. (For more, see Adios, America pp 72-74.)\nSecond, ANY amnesty means there will be lawsuits, whereupon the courts will grant amnesty to everyone. All of Latin America, including Latin Americans still living in Latin America, can mosey up sometime in the next 20 years, present themselves to a Ninth Circuit judge and claim they were brought here as children.\nHOW CAN PEOPLE BROUGHT HERE AS CHILDREN BE EXPECTED TO PROVE IT?\nApplication approved!\nHow do I know this? Because that’s how the 1986 amnesty worked.\nThe Ninth Circuit was still approving applications under the 1986 amnesty in 2007 — i.e., 20 years later — from applicants who claimed it wasn’t fair that they weren’t in the country at the time to apply for amnesty.\nThe 1986 law was also loaded with all sorts of requirements on the illegals. We’d be getting only the best! As Trump said on Tuesday, “It’s an incentive for people to do a good job, if you want to know the truth. That whole path is an incentive for people.”\nResult of requirements placed on illegals in the 1986 amnesty:\nEnglish-language requirement — dropped by the INS.\nFines — dropped by the INS.\nFees — waived by the INS.\nBack taxes — dropped by the IRS.\nCongress could pass a law giving amnesty ONLY to left-handed Ph.D.’s in nuclear physics, and everyone would get amnesty. Even illegals who haven’t arrived yet.\nIf there is a silver lining, it’s that this isn’t the first time Trump has sold out the base. He did it in the March 2016 GOP debate; in his “Hannity” interview in August 2016; in the meeting with tech leaders at Trump Tower in December 2016; and in his meeting with Nancy Pelosi and Chuck Schumer last year.\nBut it’s now Trump’s second year in office, we don’t have a wall, and he just called a meeting to say, over and over again: “We have to do DACA first.”\nAt this point, any sentient person has to see that the most plausible scenario is:\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nLucy’s gonna move the football …\nShe moved the football.\nAnn Coulter is a syndicated columnist and lawyer.\n\nThe views and opinions expressed in this commentary are those of the author and do not reflect the official position of The Daily Caller.",
        "summary": {
            "sentences": [
                "In a half-dozen exchanges — which, again, he wanted televised — Trump responded to remarks as if he had no clue what the person was saying.",
                "Because once we get DACA done — if it’s done properly — with, you know, security and everything else …”\nTrump was more than willing to sell out the base to solve a personal problem of his — the Michael Wolff book — but managed to not convince a single American that he’s articulate, bright or a good leader.",
                "The headline on Trump’s sit-down could have been:\n“TRUMP ANNOUNCES SAME FAILED AMNESTY DEAL WE HAD 30 YEARS AGO”\nThe media have done such a fantastic job lying to the public that no one knows that.",
                "He did it in the March 2016 GOP debate; in his “Hannity” interview in August 2016; in the meeting with tech leaders at Trump Tower in December 2016; and in his meeting with Nancy Pelosi and Chuck Schumer last year.",
                "But it’s now Trump’s second year in office, we don’t have a wall, and he just called a meeting to say, over and over again: “We have to do DACA first.”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.478832
            },
            "body": {
                "polarity": "neutral",
                "score": 0.384572
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://dailycaller.com/2018/01/10/coulter-it-turns-out-bannon-was-trumps-brain/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93170941",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93170941",
            "canonical": null
        }
    },
    {
        "id": 93038717,
        "title": "Late-night hosts take on Trump’s singing of national anthem",
        "body": "Late night comedians on Tuesday mocked how President Trump sang the National Anthem at the College Football Playoff national championship playoff, taking swipes after footage revealed that he mouthed along to some of the words and not others.\n\n\"You would think that a man who ran on a platform of pure patriotism and who spent months lecturing athletes on respecting the National Anthem would, at the very least, know the words to the anthem,\" comedian Seth Meyers joked on NBC's \"Late Night.\"\n\nMeyers aired a clip that showed Trump repeatedly pausing and then resuming singing the words at the game in Alabama.\n\n\"Oh, my god, Trump sings the National Anthem the way the rest of us sing 'Despacito,'\" he quipped, referring to a popular song by Puerto Rican singer Luis Fonsi.\n\n\"The Late Show\" host Stephen Colbert also made jabs at the president's selective lyric singing by airing an \"exclusive\" clip of Trump's \"isolated vocals.\"\n\nThe video has a Trump-sounding voice, that plays over the video, singing lyrics that mostly related to his remarks on Twitter.\n\n\"How much does that 'Sloppy Steve' Bannon weigh?\" the voice sings, referring the name Trump gave White House former chief strategist Stephen Bannon after their public fallout earlier this month.\n\n\"And I have, like, big brains,\" the voice says at the end, playing off of one of Trump's recent tweet that he is a \"very stable genius\" after a new book questioned his mental fitness for office.\n\n\"The Daily Show with Trevor Noah\" also took on the matter, joking that it is like people trying to sing a Rihanna's song \"Work.\"",
        "summary": {
            "sentences": [
                "Late night comedians on Tuesday mocked how President Trump sang the National Anthem at the College Football Playoff national championship playoff, taking swipes after footage revealed that he mouthed along to some of the words and not others.",
                "\"You would think that a man who ran on a platform of pure patriotism and who spent months lecturing athletes on respecting the National Anthem would, at the very least, know the words to the anthem,\" comedian Seth Meyers joked on NBC's \"Late Night.\"",
                "Meyers aired a clip that showed Trump repeatedly pausing and then resuming singing the words at the game in Alabama.",
                "\"Oh, my god, Trump sings the National Anthem the way the rest of us sing 'Despacito,'\" he quipped, referring to a popular song by Puerto Rican singer Luis Fonsi.",
                "\"The Late Show\" host Stephen Colbert also made jabs at the president's selective lyric singing by airing an \"exclusive\" clip of Trump's \"isolated vocals.\""
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.657404
            },
            "body": {
                "polarity": "positive",
                "score": 0.688279
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://thehill.com/blogs/in-the-know/in-the-know/368263-late-night-hosts-take-on-trumps-singing-of-national-anthem",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93038717",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93038717",
            "canonical": null
        }
    },
    {
        "id": 93615472,
        "title": "Presidential Physicals Should Include the Brain",
        "body": "Right now, the technology exists to detect the very early stages of Alzheimer’s disease -- as well as to flag abnormal protein deposits that can grow in peoples’ brains long before symptoms of dementia become apparent.No tests of this sort will apparently be featured in Donald Trump’s Jan. 12 physical, according to those in the know, but some brain experts and medical ethicists argue they should be. Such early evaluations might one day become important for ordinary citizens, if drugs now in the pipeline prove effective in forestalling dementia symptoms. In the meantime, it behooves us all to have more information when the brain in question belongs to someone with access to classified information and nuclear codes.The state of the current presidential brain has generated intense interest, from the gossip in journalist Michael Wolff’s new book to the concerns aired in the medical website STAT News -- including an opinion piece titled I’m a Brain Specialist. I Think Trump Should Be Tested for a Degenerative Brain Disease.\n        \n        \n        \n        Experts say an evaluation would start with simple written and oral tasks: naming items in pictures, recalling strings of letters and numbers, calling up lists of words, and the like. If those tests signal trouble, doctors might move on to a brain scan to look for protein deposits called beta amyloid.The role of beta amyloid was controversial for years, since some perfectly sharp people die and reveal brains full of this abnormal protein. Harvard neurology professor Rudoph Tanzi has led experiments in cultured human brain cells pointing to amyloid as a first step in the progression of Alzheimer’s disease. Amyloids can trigger growth of another abnormal protein deposit called neurofibrillary tangles, he said, and that situation can trigger excess inflammation, the death of brain cells, and full-blown dementia.Right now, he said, it is possible to use brain imaging to see which healthy people have a lot of beta amyloid and are therefore at elevated risk. Already several drugs have been shown to reduce amyloid plaques -- and he’s gearing up to start clinical trials of another. No drugs have restored memory or thinking ability in advanced-stage patients, but Tanzi and others have high hopes for prevention by giving the drugs much earlier.Tanzi noted that an open letter has been circulating among the medical community urging experts to demand Trump get a neuropsychological evaluation. He has not added his name, he said, because he worries the letter might be misinterpreted as a statement that Trump has dementia in the eyes of the experts. He doesn’t think Trump should be diagnosed through his television appearances, but he does agree with those who argue that all presidents should be given a genuine, science-based evaluation.He says if such evaluations started taking place, the results wouldn’t be black or white. It’s typical for people to search for words or forget names more often in their 60s than in their 20s he said, just as older people develop problems with their knees or shoulders. At the same time, people gain wisdom with age and experience. A test result showing some risk of dementia and memory decline should be weighed alongside other factors.\n        \n        Not all forms of dementia primarily affect memory. A disease called frontotemporal dementia (FTD) attacks the frontal lobe, which is the seat of judgment and impulse control. While FTD is less common than Alzheimer’s disease, it tends to hit people earlier in life -- usually starting in their 50s or 60s. Neurology professor Murray Grossman, who directs the center for FTD at the University of Pennsylvania, said that the disease is characterized by a different mix of abnormal protein deposits than Alzheimer’s, and these can be picked up in a test of spinal fluid. Some cases are characterized by extremely rigid or apathetic behavior. In other cases, people become uninhibited and prone to making inappropriate comments or gestures.People with FTD often have very little insight into their own condition, said Grossman. They may think everything is fine, while those around them grow alarmed about their changing behavior. Some patients with this disease also develop progressive aphasia -- the loss of language.Of course, other incapacitating conditions could impair a leader’s ability to function, and yet this presidential check-up may be less informative than some would hope. Family physician Ranit Mishori, of Georgetown University School of Medicine, warned not to confuse the number of tests done with the value of the information gathered. VIP or executive physicals, she said, often take more time and incorporate more tests than standard check-ups, but they don’t necessarily yield more information. That's because not all the tests are equally evidence-based.In a conversation I had several months ago with NYU medical ethicist Arthur Caplan, he said he disapproved of speculation about Trump’s mental and cognitive health. In a recent piece for Forbes.com, written with University of Pennsylvania ethicist Jonathan Moreno, he urges Congress to impose a mandatory exam that would assess factors that affect a president’s ability to do the job. It would be a physical designed not for the president’s benefit, but for ours. This seems like as good a time to start such a policy as any.This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.To contact the author of this story:                Faye Flam     at fflam1@bloomberg.netTo contact the editor responsible for this story:                Tracy Walsh     at twalsh67@bloomberg.net",
        "summary": {
            "sentences": [
                "Right now, the technology exists to detect the very early stages of Alzheimer’s disease -- as well as to flag abnormal protein deposits that can grow in peoples’ brains long before symptoms of dementia become apparent.No tests of this sort will apparently be featured in Donald Trump’s Jan. 12 physical, according to those in the know, but some brain experts and medical ethicists argue they should be.",
                "If those tests signal trouble, doctors might move on to a brain scan to look for protein deposits called beta amyloid.The role of beta amyloid was controversial for years, since some perfectly sharp people die and reveal brains full of this abnormal protein.",
                "Amyloids can trigger growth of another abnormal protein deposit called neurofibrillary tangles, he said, and that situation can trigger excess inflammation, the death of brain cells, and full-blown dementia.Right now, he said, it is possible to use brain imaging to see which healthy people have a lot of beta amyloid and are therefore at elevated risk.",
                "No drugs have restored memory or thinking ability in advanced-stage patients, but Tanzi and others have high hopes for prevention by giving the drugs much earlier.Tanzi noted that an open letter has been circulating among the medical community urging experts to demand Trump get a neuropsychological evaluation.",
                "Neurology professor Murray Grossman, who directs the center for FTD at the University of Pennsylvania, said that the disease is characterized by a different mix of abnormal protein deposits than Alzheimer’s, and these can be picked up in a test of spinal fluid."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.619363
            },
            "body": {
                "polarity": "neutral",
                "score": 0.477846
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.bloomberg.com/view/articles/2018-01-12/presidential-physicals-should-include-the-brain",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93615472",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93615472",
            "canonical": null
        }
    },
    {
        "id": 92934543,
        "title": "Late Night Hosts Mock Trump for Botching National Anthem",
        "body": "After video footage of President Donald Trump singing the national anthem at the College Football Playoff national championship game in Atlanta went viral, late night hosts mocked the President for his apparent lack of knowledge about the actual lyrics to the song.\n\nIn the original video, Trump can be seen with his hand over his heart and occasionally moving his lips, sometimes out of time with the music.\n\nStephen Colbert’s “Late Show” joked that they had obtained an isolated vocal recording of Trump’s vocals, in which a Trump-like voice “sang” about recent news items, like “Red Square, my best buddy lives there” and “How much does that Sloppy Steve Bannon weigh?” The fake vocals ended with, “And I have, like, big brains.”\n\nSeth Meyers kicked off his “Closer Look” segment addressing the event.\n\n“You would think that a man who ran on a platform of pure patriotism and who spent months lecturing athletes about respecting the national anthem, would, at the very least, know the words to the anthem,” Meyers began. “And yet, Trump seemed lost as he tried to sing along to the anthem before last night’s national college football championship.”\n\n“Trump sings the national anthem the way the rest of us sing ‘Despacito,'” Meyers quipped after a clip of the video rolled.\n\n“How can you be president and not know the words to the national anthem?” he continued. “That’s like being Payton Manning and not knowing the words to the Nationwide jingle.”",
        "summary": {
            "sentences": [
                "After video footage of President Donald Trump singing the national anthem at the College Football Playoff national championship game in Atlanta went viral, late night hosts mocked the President for his apparent lack of knowledge about the actual lyrics to the song.",
                "“You would think that a man who ran on a platform of pure patriotism and who spent months lecturing athletes about respecting the national anthem, would, at the very least, know the words to the anthem,” Meyers began.",
                "“And yet, Trump seemed lost as he tried to sing along to the anthem before last night’s national college football championship.”",
                "“Trump sings the national anthem the way the rest of us sing ‘Despacito,'” Meyers quipped after a clip of the video rolled.",
                "“How can you be president and not know the words to the national anthem?”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.87789
            },
            "body": {
                "polarity": "negative",
                "score": 0.670539
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://variety.com/2018/tv/news/late-night-trump-national-anthem-1202659466/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=92934543",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=92934543",
            "canonical": null
        }
    },
    {
        "id": 93959462,
        "title": "Baby brain a real problem affecting pregnant women",
        "body": "Research has proven 'baby brain' as a genuine phenomenon which affects the functionality of four in five pregnant women.\n\nThe research conducted by Victoria's Deakin University found the majority of expectant mothers suffer from forgetfulness, reading difficulties, confusion, disorientation and poor concentration.\n\n'Baby brain' was found to be most prominent during the third trimester of pregnancy, where functionality and memory is 'significantly reduced', the Daily Telegraph reported.\n\nDeakin University associate professor Linda Byrne said the findings - which were published in the Medical Journal of Australia on Monday - give pregnant women a genuine excuse for mental fog.\n\n'It was certainly thought of as being a myth, which diminishes a woman's experience of what she's going through, but it is a real thing and it is measurable,' Prof Byrne told the publication.\n\n'Anecdotally, it is something that we have known for a long time ... a large number of women talk about feeling a bit foggy and we are saying that it is real.'\n\nThe findings followed the analysis of 20 separate studies on a total of 709 pregnant and 521 non-pregnant women.\n\nBut although the phenomenon is real and quantifiable, Prof Byrne said its effect is minimal and still allows pregnant women to perform within the normal range of cognitive function.\n\nShe added: 'It’s not something that is at a level that we need to worry about, it is not going to affect how a woman does her job and day-to-day life.'\n\nThe cognitive changes are suspected to be related to the brain 'reorganising itself' and prioritising other tasks during pregnancy, Prof Byrne said.",
        "summary": {
            "sentences": [
                "Research has proven 'baby brain' as a genuine phenomenon which affects the functionality of four in five pregnant women.",
                "Deakin University associate professor Linda Byrne said the findings - which were published in the Medical Journal of Australia on Monday - give pregnant women a genuine excuse for mental fog.",
                "'It was certainly thought of as being a myth, which diminishes a woman's experience of what she's going through, but it is a real thing and it is measurable,' Prof Byrne told the publication.",
                "The findings followed the analysis of 20 separate studies on a total of 709 pregnant and 521 non-pregnant women.",
                "But although the phenomenon is real and quantifiable, Prof Byrne said its effect is minimal and still allows pregnant women to perform within the normal range of cognitive function."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.822859
            },
            "body": {
                "polarity": "negative",
                "score": 0.564782
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.dailymail.co.uk/news/article-5267907/Baby-brain-real-problem-affecting-pregnant-women.html?ITO=1490&ns_mchannel=rss&ns_campaign=1490",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93959462",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93959462",
            "canonical": null
        }
    },
    {
        "id": 92922312,
        "title": "Late-Night Hosts Debate Trump's Grasp of National Anthem",
        "body": "\"Trump sings the National Anthem the way the rest of us sing 'Despacito.' \"\n \n\n\nEver since footage of President Trump singing the National Anthem on camera at Monday night's college football national championship went viral, social-media users and reporters have been debating whether he knows the words. On Tuesday night, late-night hosts weighed in, too — and offered a resounding \"no.\"\n\"You would think that a man who ran on a platform of pure patriotism, and who spent months lecturing athletes on respecting the National Anthem would, at the very least, know the words to the anthem,\" host Seth Meyers joked on Late Night.\nAfter playing the clip, which shows Trump pausing in parts and singing out of time in others, the host said, \"Oh my god, Trump sings the National Anthem the way the rest of us sing 'Despacito.'\" He added, \"Seriously, how can you be president and not know the words to the National Anthem? That's like being Peyton Manning and not knowing the words to the Nationwide jingle.\"\nVIDEO\nOn The Late Show, host Stephen Colbert jokingly claimed he had received exclusive footage of President Trump's \"isolated vocals\" in the clip. The video that follows has a Trump-sounding voice singing a nonsensical tune that incorporates lyrics harkening to recent news stories about the embattled president.\n\"How much does that 'Sloppy Steve' Bannon weigh?\" the voice sings in one part, referring to Trump's social-media moniker for his White House's former chief strategist.\n\"Love TV,\" he sings in another, recalling reports that Trump watches up to eight hours of TV a day. \"And I have, like, big brains,\" he sings in the finale, his lyric resembling a recent tweet Trump sent, rebutting reports in Michael Wolff's Fire and Fury that he is mentally unfit for office.\nVIDEO\nThe Daily Show with Trevor Noah took a more forgiving approach to Trump's alleged memory loss, going out on the street to ask pedestrians if they knew all the lyrics to the anthem. \n\"I don't know the exact words,\" one passer-by tells Daily Show correspondent Dulce Sloan.\nAnother struggles with the line \"the dawn's early light,\" even as Sloan offers a hint, pointing him to the sky, and one sings a combination of two lines -- \"the dawn's early gleaming\" -- in a spot where neither applies.\nAnd when Sloan suggested that pedestrians take a knee while singing, most refuse, with one man saying, \"I don't have time for that.\"\n\nOk, sure, Trump doesn’t know the lyrics to the national anthem, but do average Americans know it? @dulcesloan finds out: pic.twitter.com/NN6WYwyG1r\n— The Daily Show (@TheDailyShow) January 10, 2018\n\n\n\n\n\nStephen Colbert\nSeth Meyers\nLate-Night Lately",
        "summary": {
            "sentences": [
                "Ever since footage of President Trump singing the National Anthem on camera at Monday night's college football national championship went viral, social-media users and reporters have been debating whether he knows the words.",
                "\"You would think that a man who ran on a platform of pure patriotism, and who spent months lecturing athletes on respecting the National Anthem would, at the very least, know the words to the anthem,\" host Seth Meyers joked on Late Night.",
                "After playing the clip, which shows Trump pausing in parts and singing out of time in others, the host said, \"Oh my god, Trump sings the National Anthem the way the rest of us sing 'Despacito.'\"",
                "VIDEO\nOn The Late Show, host Stephen Colbert jokingly claimed he had received exclusive footage of President Trump's \"isolated vocals\" in the clip.",
                "VIDEO\nThe Daily Show with Trevor Noah took a more forgiving approach to Trump's alleged memory loss, going out on the street to ask pedestrians if they knew all the lyrics to the anthem."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.572072
            },
            "body": {
                "polarity": "negative",
                "score": 0.949218
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://feedproxy.google.com/~r/thr/television/~3/8rRwa2TGa4s/late-night-hosts-debate-trumps-grasp-national-anthem-1073526",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=92922312",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=92922312",
            "canonical": "https://www.hollywoodreporter.com/live-feed/late-night-hosts-debate-trumps-grasp-national-anthem-1073526"
        }
    },
    {
        "id": 93508505,
        "title": "Revisiting diaspora policy and the brain drain",
        "body": "On August 5, 2017, I wrote about the need for a Diaspora Policy for Trinidad and Tobago. With the impending arrival of hundreds of overseas nationals for Carnival it is as good a time as any to revisit what ought to be an imperative for our national development.\n\nAs much as we need to highlight the achievements of selected individuals we should also look at the broad mass of people who have migrated and acquired a range of skills abroad.\n\nAccording to the World Economic Forum 22 per cent of the local population, amounting to 360,000 people, live outside of T&T.\n\nIn my March letter to the editor I referenced comments from Dr Michele Reis, author of The Who’s Who in the Trinidad and Tobago Diaspora.\n\nShe said one avenue in alleviating developmental problems lies in harnessing the skills of the Diaspora. Furthermore, her analysis was that this had not been achieved in T&T because successive governments and the constituent community in the homeland, have failed to recognise the overseas population as an integral part of the nation.\n\nIn two Caricom countries, Jamaica and Guyana, the Prime Ministers and Foreign Ministers have embraced a Diaspora Policy.\n\nJamaica’s Prime Minister, Mr Andrew Holness, on April 4 last year, launched the seventh biennial Jamaica Diaspora Conference which was organised by the Ministry of Foreign Affairs and Foreign Trade.\n\nIn July Guyana’s President David Granger delivered the keynote address to declare the opening of the First University of Guyana Diaspora Engagement Conference.\n\nGuyana established a ministerial sub-committee comprising foreign affairs, public security, state, finance, business and citizenship to finalise the Government’s Diaspora Engagement Strategy and Action Plan.\n\nWithin any Diaspora Policy T&T must address our brain drain. The problem is not unknown to opinion leaders of this country because there was commentary about the departure of skilled (and unskilled people) between Independence in 1962 and before the Trinidad and Tobago Revolution of 1970.\n\nChalkdust (Dr Hollis Liverpool), put his own spin on the loss of our human resource. In 1968 he sang:\n\nJust because some teachers move away. To improve their status and their pay. Plenty people calling this Brain Drain. But I say they should be shame.\n\nThey ain’t see Horace James and Errol John. Teaching drama to foreign sons. They would never see our best footballers. In the States as professionals.\n\nAh hope you see look sailors and police went to Expo. And only one true calypsonian go. And when foreign artiste come. They does get lump sum.\n\nAnd calypsonians must sing for rum. And when steel bandsmen teach them outsiders. To tune a pan for kisses and favours. That is what I call Brain Drain.\n\nDuring the 1971 Budget presentation Mr Francis Prevatt, Minister of Finance, Planning and Development, spoke about migration. Significantly his statement was made one day prior to NJAC’s Rededication Day demonstration, the first after the State of Emergency.\n\nPrevatt revealed, “between 1962 and 1968 there were 17,200 emigrants from this country, among whom were 11,500 professional or technically qualified people. Included in this number were 143 doctors, 170 engineers, 679 nurses, 784 teachers, 909 other professionals and over 8,200 technicians and craftsmen”.\n\nHe added, “The brain drain presents this country with an extremely intractable dilemma, one which can only be solved by appropriate motivation and by negotiations with the principal countries receiving our emigrants”.\n\nResearch has revealed that from 1962 to 1968, a total of 70 per cent of T&T’s university graduates migrated from this country or just stayed overseas after their studies.\n\nThe point is that too much time has elapsed since we were made aware of the need for a Diaspora Policy as well as the gravity of the Brain Drain. All interest groups, the Government, the Diaspora itself and private citizens here in T&T have a responsibility to address these related issues.",
        "summary": {
            "sentences": [
                "In two Caricom countries, Jamaica and Guyana, the Prime Ministers and Foreign Ministers have embraced a Diaspora Policy.",
                "Jamaica’s Prime Minister, Mr Andrew Holness, on April 4 last year, launched the seventh biennial Jamaica Diaspora Conference which was organised by the Ministry of Foreign Affairs and Foreign Trade.",
                "Guyana established a ministerial sub-committee comprising foreign affairs, public security, state, finance, business and citizenship to finalise the Government’s Diaspora Engagement Strategy and Action Plan.",
                "Within any Diaspora Policy T&T must address our brain drain.",
                "The point is that too much time has elapsed since we were made aware of the need for a Diaspora Policy as well as the gravity of the Brain Drain."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.643459
            },
            "body": {
                "polarity": "negative",
                "score": 0.903618
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.guardian.co.tt/columnist/2018-01-11/revisiting-diaspora-policy-and-brain-drain",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93508505",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93508505",
            "canonical": null
        }
    },
    {
        "id": 93188024,
        "title": "White Flight: Trump’s West Wing Braces for a Brain Drain",
        "body": "OF MICE AND MEN\nDonald Trump as Frank Sinatra, Kellyanne Conway as Angie Dickinson, Steve Bannon as Dean Martin, Jared Kushner as Peter Lawford, and Reince Priebus as Joey Bishop.Illustration by Barry Blitt.As staff nervously eye the exits, the White House has reportedly offered an ultimatum: either leave before the end of January or stay put until the November midterm elections, CNN reports. The deadline is intended to balance an ongoing reshuffle with the threat of a larger exodus—a chaotic combination made worse by the Trump administration’s struggle to find qualified candidates. It’s also a charge the White House vigorously denies. “There has been no directive on staff departures and any suggestion otherwise is ridiculous fake news,” said Sarah Huckabee Sanders.Despite these protestations, there are inarguably some gaping holes in Donald Trump’s team. The role of chief strategist, once occupied by Steve Bannon, is conspicuously vacant. As is the senior aide position held by Keith Schiller, the former security chief who moved to the White House as an aide-de-camp and left in September. The embattled Office of Political Affairs remains in a state of transition: While current head Bill Stepien is set to remain in place (for how long is unclear), he will now be overseen by Johnny DeStafano, pulling triple duty at the Office of Presidential Personnel and the Office of Public Liaison and the Office of Intergovernmental Affairs. Although the promotion speaks to his competence, it also suggests that Chief of Staff John Kelly, who has vowed to fill the ranks by the end of January, is struggling to find anyone else to take on the roles.There are multiple reasons for the lack of enthusiastic and suitably qualified candidates. The first is ideological. The extremity of Trump’s stances have alienated many Republicans, who fear working in the White House might tarnish the trajectory of their careers. Trump, in turn, is not keen to hire anyone who might prove even somewhat disloyal. “There are still a lot of people who have said they are unwilling to work in the White House and there are a lot of people the White House are unwilling to have come in,” Republican operative Doug Heye told CNN.The more obvious problem is turnover: Dina Powell and Jeremy Katz are exeunt stage left, with Gary Cohn expected soon thereafter. While Jared Kushner and Ivanka Trump apparently plan to remain in Washington at least through the 2018 school year, few believe they will stay long. More notable casualties include Sean Spicer, infamous purveyor of “alternative facts”; Michael Flynn, who was ostensibly fired for lying to Vice President Mike Pence and recently pleaded guilty to lying to the F.B.I.; Sebastien Gorka, whose association with extremist politics in Hungary have not diminished his star at Fox News; and, of course, the silver-tongued Anthony Scaramucci.The Brookings Institution concludes that the Trump administration has seen more exits than any first year president in the last four decades, with 34 percent of Trump’s senior staff departing in the past year alone.The larger issue isn’t necessarily Trump’s tendency to shed staff, but his difficulty attracting new talent. It is no secret that nearly everyone who has worked for Trump in a public-facing role has, at some point, been subject to humiliation, either in their interactions with the press—à la Spicer—or at the hands of their boss, as Attorney General Jeff Sessions can affirm. And then there is the specter of Robert Mueller’s Russia probe, which has already led to four indictments, and is now circling closer to Trump. As one person familiar with the White House’s staffing challenges told CNN, candidates that might otherwise fill some West Wing vacancies don’t see working for Trump as a prestigious career move. They see it as a potential “ticket to the grand jury.”",
        "summary": {
            "sentences": [
                "OF MICE AND MEN\nDonald Trump as Frank Sinatra, Kellyanne Conway as Angie Dickinson, Steve Bannon as Dean Martin, Jared Kushner as Peter Lawford, and Reince Priebus as Joey Bishop.Illustration by Barry Blitt.As staff nervously eye the exits, the White House has reportedly offered an ultimatum: either leave before the end of January or stay put until the November midterm elections, CNN reports.",
                "“There has been no directive on staff departures and any suggestion otherwise is ridiculous fake news,” said Sarah Huckabee Sanders.Despite these protestations, there are inarguably some gaping holes in Donald Trump’s team.",
                "The extremity of Trump’s stances have alienated many Republicans, who fear working in the White House might tarnish the trajectory of their careers.",
                "More notable casualties include Sean Spicer, infamous purveyor of “alternative facts”; Michael Flynn, who was ostensibly fired for lying to Vice President Mike Pence and recently pleaded guilty to lying to the F.B.I.; Sebastien Gorka, whose association with extremist politics in Hungary have not diminished his star at Fox News; and, of course, the silver-tongued Anthony Scaramucci.The Brookings Institution concludes that the Trump administration has seen more exits than any first year president in the last four decades, with 34 percent of Trump’s senior staff departing in the past year alone.The larger issue isn’t necessarily Trump’s tendency to shed staff, but his difficulty attracting new talent.",
                "As one person familiar with the White House’s staffing challenges told CNN, candidates that might otherwise fill some West Wing vacancies don’t see working for Trump as a prestigious career move."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.614546
            },
            "body": {
                "polarity": "negative",
                "score": 0.98071
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://www.vanityfair.com/news/2018/01/white-flight-trumps-west-wing-braces-for-a-brain-drain",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93188024",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93188024",
            "canonical": null
        }
    },
    {
        "id": 93481239,
        "title": "Trump’s Conventional National Security Strategy",
        "body": "The Trump administration’s National Security Strategy starts by declaring that it will use “principled realism” to put American interests, values and prosperity first. It says that engagement with the world needn’t mean abandoning national self-interest, that great power competition should be the main preoccupation of U.S. security, and that allies should do more to provide for their own defense. Such realist rhetoric offends most foreign-policy pundits in Washington, who tend to deny that U.S. interests and global goods are distinguishable.\nThe critics have it backwards. The strategy isn’t too realist or too narrowly focused on American interests. Its problem lies in its shortcomings in properly applying those principles. Rather than chart an overdue departure from the overwrought approach to security that this administration inherited, the strategy endorses it with vaguely realist rhetoric. It proposes too little meaningful change aside from a few protectionist measures, which would harm our economic prosperity even though the strategy claims that as its lodestar.\n\n\nThis lack of prioritization mirrors U.S. security policy. Formal strategy statements like this one are supposed to guide security policy, but mostly they promote it. As U.S. foreign policy has grown more ambitious, especially since the Cold War ended, strategy statements have become less focused. They avoid the fundamental purpose of strategy, which is to prioritize, guiding the allocation of limited resources to most efficiently protect our national interests. Instead they indulge in flights of rhetorical fancy about the virtues of U.S. power, imagining that peace, liberalism and stability everywhere depend on our self-appointed role as global sheriff.\nThe Obama administration’s last National Security Strategy, for instance, lists eight “top-strategic risks,” including “disease, economic slowdown, and climate change.” It mentions “hard choices” and warns against “overreach” but declares that “there are no global problems that cannot be solved without the United States.”\nDefining security so capaciously exaggerates danger, making our strong geopolitical position seem precarious when it is the envy of every other country. The document’s lack of prioritization demands excessive Pentagon spending and calls for missions that needlessly overburden the military. Its preoccupation with peripheral concerns comes at the expense of core U.S. interests: defending Americans, enhancing our prosperity, and protecting our way of life.\nWith its stated focus on those goals and its relatively direct language, the Trump strategy initially seems poised to avoid these pitfalls. But upon close inspection, mostly it doesn’t, and it adds a few of its own. Let’s take its good ideas, its bad execution and its ugly new problems in turn.\nThe Good\nIn addition to its promising start, the document deserves praise for focusing on U.S. values and prosperity. These goods are too easily sacrificed when dangers are invoked. The strategy correctly calls the $20 trillion and counting in national debt “a grave threat to America’s long-term prosperity and, by extension, our national security.” That’s a useful reminder as spending hikes threaten to send the debt even higher.\nThe new strategy’s conclusion also contains a noteworthy paragraph:\nThis strategy is guided by principled realism. It is realist because it acknowledges the central role of power in international politics, affirms that sovereign states are the best hope for a peaceful world, and clearly defines America’s national interests. It is principled because it is grounded in the knowledge that advancing American principles spreads peace and prosperity around the globe. We are guided by our values and disciplined by our interests.Pages",
        "summary": {
            "sentences": [
                "The Trump administration’s National Security Strategy starts by declaring that it will use “principled realism” to put American interests, values and prosperity first.",
                "It says that engagement with the world needn’t mean abandoning national self-interest, that great power competition should be the main preoccupation of U.S. security, and that allies should do more to provide for their own defense.",
                "Rather than chart an overdue departure from the overwrought approach to security that this administration inherited, the strategy endorses it with vaguely realist rhetoric.",
                "The Obama administration’s last National Security Strategy, for instance, lists eight “top-strategic risks,” including “disease, economic slowdown, and climate change.”",
                "The strategy correctly calls the $20 trillion and counting in national debt “a grave threat to America’s long-term prosperity and, by extension, our national security.”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.592209
            },
            "body": {
                "polarity": "neutral",
                "score": 0.821132
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://nationalinterest.org/node/24035",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93481239",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93481239",
            "canonical": null
        }
    },
    {
        "id": 92978145,
        "title": "Let’s rethink president’s song",
        "body": "Traditionally, the U.S. Marine Band has played “Hail to the Chief” when the president arrives at state functions. However, since Vladimir Putin is not present at these events, is it proper to play it?\n\nOf course, we cannot play the Russian national anthem. So what should the band play for Donald Trump?\n\nI would like to suggest something I feel would be quite appropriate: the Scarecrow’s song “If I Only Had a Brain,” from “The Wizard of Oz.”",
        "summary": {
            "sentences": [
                "Traditionally, the U.S. Marine Band has played “Hail to the Chief” when the president arrives at state functions.",
                "So what should the band play for Donald Trump?"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.575752
            },
            "body": {
                "polarity": "negative",
                "score": 0.493364
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://lasvegassun.com/news/2018/jan/10/lets-rethink-presidents-song/",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=92978145",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=92978145",
            "canonical": null
        }
    },
    {
        "id": 93169521,
        "title": "Ann Coulter: It Turns Out Bannon WAS Trump’s Brain | VDARE - premier news outlet for patriotic immigration reform",
        "body": "In order to prove he doesn’t have dementia, as alleged in a recent book, President Trump called a meeting with congressional leaders on Tuesday—and requested that it be televised.\n\nIvanka: Show them at your best, Daddy!\n\nHe then proceeded to completely sell out the base and actually added to his problems by appearing senile.\n\nIn a half-dozen exchanges—which, again, he wanted televised—Trump responded to remarks as if he had no clue what the person was saying. One senator would talk—he’d agree. Someone else would say the exact opposite—he’d agree with that, too.\n\nSEN. DIANNE FEINSTEIN: “What about a clean DACA bill now, with a commitment that we go into a comprehensive immigration reform procedure? …” TRUMP: “… I have no problem. … We’re going to come up with DACA. We’re going to do DACA, and then we can start immediately on the phase two, which would be comprehensive.” SEN. FEINSTEIN: “Would you be agreeable to that?” TRUMP: “I think a lot of people would like to see that, but I think we have to do DACA first.” REP. KEVIN MCCARTHY: “Mr. President, you need to be clear though. I think what Sen. Feinstein is asking here: When we talk about just DACA, we don’t want to be back here two years later. You have to have security, as the secretary would tell you.” REP. MCCARTHY: “No, no, I think she’s saying something different. …” TRUMP: “I do believe that. Because once we get DACA done—if it’s done properly—with, you know, security and everything else …”\n\nTrump was more than willing to sell out the base to solve a personal problem of his—the Michael Wolff book—but managed to not convince a single American that he’s articulate, bright or a good leader.\n\nOn MSNBC, the hosts didn’t say, “You know, we saw a new side of Trump today …” Instead, they could barely suppress their giggles over the great negotiator being rolled.\n\nThe Democrats’ opening bid is: Not only does every poor person in the world get to come live here, but all their relatives get to come, too!\n\nThey don’t control any branch of government, and they’re not budging from that.\n\nTrump’s counter-offer is: OK! My immigration policy is whatever you send me!\n\nThe end result was: On the left, they’re happy, but still think Trump’s a moron. On the right, they’re unhappy, and also think Trump’s a moron.\n\nThe people who do not realize Tuesday was the lowest moment of the Trump presidency have no idea what they’re talking about. The headline on Trump’s sit-down could have been:\n\n“TRUMP ANNOUNCES SAME FAILED AMNESTY DEAL WE HAD 30 YEARS AGO”\n\nThe media have done such a fantastic job lying to the public that no one knows that.\n\nTo the average viewer, it sounds like a totally fair deal. We give only the BEST illegals a “pathway” to citizenship, they’ll have to jump through all sorts of hoops, and in return, we’ll get REAL security.\n\nThat’s exactly what we were promised the last time. What we got: No hoops, no security and everyone got amnesty.\n\nYou don’t need chain migration for the alleged 800,000 “Dreamers” to swell to 60 million—or 100 or 200 million. First, there are already at least 50 million illegals (aka Dreamers) living here. (For more, see Adios, America pp 72-74.)\n\nSecond, ANY amnesty means there will be lawsuits, whereupon the courts will grant amnesty to everyone. All of Latin America, including Latin Americans still living in Latin America, can mosey up sometime in the next 20 years, present themselves to a Ninth Circuit judge and claim they were brought here as children.\n\nHOW CAN PEOPLE BROUGHT HERE AS CHILDREN BE EXPECTED TO PROVE IT?\n\nHow do I know this? Because that’s how the 1986 amnesty worked.\n\nThe Ninth Circuit was still approving applications under the 1986 amnesty in 2007—i.e., 20 years later—from applicants who claimed it wasn’t fair that they weren’t in the country at the time to apply for amnesty.\n\nThe 1986 law was also loaded with all sorts of requirements on the illegals. We’d be getting only the best! As Trump said on Tuesday, “It’s an incentive for people to do a good job, if you want to know the truth. That whole path is an incentive for people.”\n\nResult of requirements placed on illegals in the 1986 amnesty:\n\nCongress could pass a law giving amnesty ONLY to left-handed Ph.D.’s in nuclear physics, and everyone would get amnesty. Even illegals who haven’t arrived yet.\n\nIf there is a silver lining, it’s that this isn’t the first time Trump has sold out the base. He did it in the March 2016 GOP debate; in his “Hannity” interview in August 2016; in the meeting with tech leaders at Trump Tower in December 2016; and in his meeting with Nancy Pelosi and Chuck Schumer last year.\n\nBut it’s now Trump’s second year in office, we don’t have a wall, and he just called a meeting to say, over and over again: “We have to do DACA first.”\n\nAt this point, any sentient person has to see that the most plausible scenario is:",
        "summary": {
            "sentences": [
                "TRUMP: “I think a lot of people would like to see that, but I think we have to do DACA first.”",
                "Because once we get DACA done—if it’s done properly—with, you know, security and everything else …”\n\nTrump was more than willing to sell out the base to solve a personal problem of his—the Michael Wolff book—but managed to not convince a single American that he’s articulate, bright or a good leader.",
                "The headline on Trump’s sit-down could have been:\n\n“TRUMP ANNOUNCES SAME FAILED AMNESTY DEAL WE HAD 30 YEARS AGO”\n\nThe media have done such a fantastic job lying to the public that no one knows that.",
                "He did it in the March 2016 GOP debate; in his “Hannity” interview in August 2016; in the meeting with tech leaders at Trump Tower in December 2016; and in his meeting with Nancy Pelosi and Chuck Schumer last year.",
                "But it’s now Trump’s second year in office, we don’t have a wall, and he just called a meeting to say, over and over again: “We have to do DACA first.”"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.791509
            },
            "body": {
                "polarity": "neutral",
                "score": 0.574307
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.vdare.com/articles/ann-coulter-it-turns-out-bannon-was-trumps-brain",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93169521",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93169521",
            "canonical": null
        }
    },
    {
        "id": 93508309,
        "title": "Lawrence O'Donnell Says What The Media Won't By Calling Out Trump Hate Filled And Failing Brain",
        "body": "Lawrence O’Donnell went straight to a subject other members of the media are afraid to touch. O’Donnell discussed in detail Trump’s hate-filled and failing brain.\n\nO’Donnell said, “Donald Trump knows nothing about where we all came from. And he is a man consumed by hatreds and we can see him consumed by hatreds every day, individual hatreds like his newfound hatred of Steve Bannon as well as group hatreds from mention conditions to muslims and hating countries is second nature to Donald Trump. Hating is what he does. There are 54 African countries Donald Trump surely cannot name more than 2 of them. But he knows what he thinks about all of them. Every country in Africa and he said that today. It’s not the first time we got a look into this poisoned section of the president’s brain. The president’s failing brain. I say failing brain because it’s a brain that fails public intelligence tests every single day. It may also be failing for medical or other reasons but it fails right before our eyes. Every day which is why the lead editorial The New York Times today is, is Mr. Trump nuts? The New York Times has never considered such a question about the president of the united States before and tonight “The New York Times” has even more reason to raise that issue. But none of us, none of us can claim to be surprised by what Donald Trump said today because he said it all before in various ways.”\n\nAmerica is faced with a question that it has never faced before. What happens to the nation when the man who took an oath to lead it has a brain that is both hate-filled and failing?\n\nThe portrait that the White House and Trump allies were trying to paint just two days ago of a man who is competent and in charge now seems quaint and outdated. The real Donald Trump is a man with a failing mind who is driven by hatreds and prejudices. There was never a master strategy to use hatred to divide the country.\n\nWe know that Trump isn’t that smart. Trump’s hate and prejudice against people for their race, religion, gender, or sexual orientation was never planned. It is just who he is, and the fact that so many Americans voted for this broken hate machine says more about them than it does about Trump.\n\nTrump’s brain is failing, and he is taking America along for the ride.",
        "summary": {
            "sentences": [
                "O’Donnell discussed in detail Trump’s hate-filled and failing brain.",
                "And he is a man consumed by hatreds and we can see him consumed by hatreds every day, individual hatreds like his newfound hatred of Steve Bannon as well as group hatreds from mention conditions to muslims and hating countries is second nature to Donald Trump.",
                "Every day which is why the lead editorial The New York Times today is, is Mr. Trump nuts?",
                "The real Donald Trump is a man with a failing mind who is driven by hatreds and prejudices.",
                "Trump’s brain is failing, and he is taking America along for the ride."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.975903
            },
            "body": {
                "polarity": "negative",
                "score": 0.627437
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.politicususa.com/2018/01/11/lawrence-odonnell-media-calling-trump-hate-filled-failing-brain.html",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93508309",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93508309",
            "canonical": null
        }
    },
    {
        "id": 93425558,
        "title": "Fox's Bartiromo rips 'crazy' poll results of Obama getting more credit than Trump on economy",
        "body": "Fox Business Network host Maria Bartiromo on Thursday knocked the results of a recent poll showing former President Barack Obama Barack Hussein ObamaPatagonia files suit against Trump cuts to Utah monuments Former Dem Tenn. gov to launch Senate bid: report Eighth Franken accuser comes forward as Dems call for resignation MORE getting more credit for the nation's economy than President Trump Donald John TrumpHouse Democrat slams Donald Trump Jr. for ‘serious case of amnesia’ after testimony Skier Lindsey Vonn: I don’t want to represent Trump at Olympics Poll: 4 in 10 Republicans think senior Trump advisers had improper dealings with Russia MORE, saying she thinks \"that's when somebody's ideology overtakes their brain.\"\n\n“I find this really crazy. I think that's when somebody’s ideology overtakes their brain you have a problem because ideologies, I think, are dominating that poll,\" Bartiromo, who joined Fox Business from CNBC in 2014, said during an interview on Fox News.\n\nBartiromo was commenting on a Quinnipiac University poll released Wednesday showing that 49 percent of respondents say they think that improving economic conditions are because of Obama, with just 40 percent crediting Trump.\n\n\"There is no doubt that the expansion bottomed out under President Obama, there’s no doubt,\" Bartiromo asserted Thursday. \"The stock market and the economic recovery began under President Obama, no doubt about it, it was in 2009 was the bottom of the market when we first started seeing a change in terms of economic growth.\"\n\n\"But we have been growing in the last 10 years by on average 2 percent under President Obama. His best year was the worst year for most presidents. So, once President Trump started campaigning on these policies about lowering taxes, about rolling back regulations, there was an anticipation that started to creep up and that started to force businesses to unleash the purse strings. There is a reason that businesses were sitting on so much cash under the Obama Administration, and that is because they were getting strangled by regulation,\" she continued. \n\n\n\n\"President Trump comes in, he rolls back all of these regulations and almost instantaneously businesses said, ‘OK, we’re not going to be shackled anymore and we’ll start looking for opportunities to put that money to work whether it’s hiring people or investing in their business.’ There is no doubt about it.”\n\nQuinnipiac has asked the same poll question in other months. The percentage of those crediting Trump for the nation's economy rose steadily through most of the year, topping 43 percent in December before ticking back down to 40 percent this month.\n\nThe January poll also finds that 66 percent of U.S. voters say the economy is “excellent” or “good,” the most positive rating for the economy in the poll since 2001.",
        "summary": {
            "sentences": [
                "Fox Business Network host Maria Bartiromo on Thursday knocked the results of a recent poll showing former President Barack Obama Barack Hussein ObamaPatagonia files suit against Trump cuts to Utah monuments Former Dem Tenn. gov to launch Senate bid: report Eighth Franken accuser comes forward as Dems call for resignation MORE getting more credit for the nation's economy than President Trump Donald John TrumpHouse Democrat slams Donald Trump Jr. for ‘serious case of amnesia’ after testimony Skier Lindsey Vonn: I don’t want to represent Trump at Olympics Poll: 4 in 10 Republicans think senior Trump advisers had improper dealings with Russia MORE, saying she thinks \"that's when somebody's ideology overtakes their brain.\"",
                "Bartiromo was commenting on a Quinnipiac University poll released Wednesday showing that 49 percent of respondents say they think that improving economic conditions are because of Obama, with just 40 percent crediting Trump.",
                "\"There is no doubt that the expansion bottomed out under President Obama, there’s no doubt,\" Bartiromo asserted Thursday.",
                "So, once President Trump started campaigning on these policies about lowering taxes, about rolling back regulations, there was an anticipation that started to creep up and that started to force businesses to unleash the purse strings.",
                "\"President Trump comes in, he rolls back all of these regulations and almost instantaneously businesses said, ‘OK, we’re not going to be shackled anymore and we’ll start looking for opportunities to put that money to work whether it’s hiring people or investing in their business.’"
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.595256
            },
            "body": {
                "polarity": "negative",
                "score": 0.542735
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://thehill.com/homenews/media/368545-foxs-bartiromo-rips-crazy-poll-results-of-obama-getting-more-credit-than-trump",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93425558",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93425558",
            "canonical": null
        }
    },
    {
        "id": 93752228,
        "title": "Who Is 'Trump's Brain'? There Are Three, Actually",
        "body": "Christopher Buskirk, editor of the pro-Trump website American Greatness, writes in a Washington Post op-ed that we shouldn't believe that silly old Michael Wolff book because the president, far from being a puppet manipulated by Svengalis such as Steve Bannon, is a political giant who's transforming American politics all on his own:\nAccusations that Trump is being manipulated by his advisers — always wrong but nonetheless repeated so often as to take on the appearance of truth — must now cease. And so must the rhetorical conflation of Trump and Bannon. Trump must be seen as his own man and judged by his own words.\n... with Bannon clearly out of Trump’s inner circle, there can be no whispers of a power structure outside the White House. Like Ronald Reagan, Trump keeps his own counsel. There is no Valerie Jarrett or Karl Rove. It’s just the president and his agenda.\n\nSo there isn't an adviser who can be called \"Trump's brain\"? I guess that's true -- there isn't an adviser who fills that role.\nThere are three:\n\nJonathan Chait explains:\nDuring his morning Executive Time, President Trump took a well-deserved break from his long hours of document study to watch Fox News. The segment featured one of the talking heads urging Trump to oppose the House bill reauthorizing the Foreign Intelligence Surveillance Act (FISA). The president immediately tweeted out his alarmed confusion that the House was apparently on the verge of approving the very law the sinister Deep State had used to “tapp” his phones:\n\n“House votes on controversial FISA ACT today.” This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?\n— Donald J. Trump (@realDonaldTrump) January 11, 2018\n\n... The president’s alarm was unfortunate, since the Trump administration strongly supports reauthorization of this law. It has sent its highest-ranking security officials to lobbyCongress for reauthorization, and reiterated its endorsement of the law as recently as last night.\n\n↓ Story continues below ↓So I guess there can be \"whispers of a power structure outside the White House\" after all -- or not whispers exactly, because anyone can see exactly where that power structure is by turning on the TV in the morning.\nAnd as for Trump \"keep[ing] his own counsel,\" consider what happened next:\nApparently somebody has explained the administration’s position to the president, who has followed up his old tweet opposing the House bill with a new one supporting it:\n\nWith that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart!\n— Donald J. Trump (@realDonaldTrump) January 11, 2018\n\nSo first Trump proclaimed his enthusiastic agreement with a guest on his favorite TV show, then he expressed agreement with a staffer who'd gently explained to him that the guest on his favorite TV show was wrong. In each case, he declared himself in agreement with the last person who'd talked to him. Yeah, that's what keeping one's own counsel looks like, isn't it?\nOriginally published at No More Mr. Nice Blog",
        "summary": {
            "sentences": [
                "Christopher Buskirk, editor of the pro-Trump website American Greatness, writes in a Washington Post op-ed that we shouldn't believe that silly old Michael Wolff book because the president, far from being a puppet manipulated by Svengalis such as Steve Bannon, is a political giant who's transforming American politics all on his own:\nAccusations that Trump is being manipulated by his advisers — always wrong but nonetheless repeated so often as to take on the appearance of truth — must now cease.",
                "... with Bannon clearly out of Trump’s inner circle, there can be no whispers of a power structure outside the White House.",
                "The segment featured one of the talking heads urging Trump to oppose the House bill reauthorizing the Foreign Intelligence Surveillance Act (FISA).",
                "— Donald J. Trump (@realDonaldTrump) January 11, 2018\n\n... The president’s alarm was unfortunate, since the Trump administration strongly supports reauthorization of this law.",
                "And as for Trump \"keep[ing] his own counsel,\" consider what happened next:\nApparently somebody has explained the administration’s position to the president, who has followed up his old tweet opposing the House bill with a new one supporting it:\n\nWith that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "negative",
                "score": 0.748872
            },
            "body": {
                "polarity": "negative",
                "score": 0.769328
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "https://crooksandliars.com/2018/01/who-trumps-brain-there-are-three-actually",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93752228",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93752228",
            "canonical": null
        }
    },
    {
        "id": 93097051,
        "title": "‘Scientists must uphold facts when leaders like Trump are dismissive of it’",
        "body": "In an era when leaders such as the President of the United States of America Donald Trump are driven by ideological reasons rather than scientific fact, it is incumbent on scientists to educate the public about the power of science to solve critical problems, said Nobel laureate Kip Thorne during the Infosys Science Foundation Awards presentation ceremony on Wednesday.\n\nAt the ceremony, six persons were presented the awards for their contributions to science.\n\nMr. Thorne, who won the Nobel Prize for Physics in 2017 for his work on gravitational waves, said the Nobel prize and awards such as these thrust scientists into becoming an ‘icon of science’ in the eyes of the general public.\n\n\"We scientists have an obligation to educate the public and our leaders about scientific fact and the power of science to resolve our problems. And this obligation is particularly strong on icons of science,\" said Mr. Thorne. “People like Trump don’t know the difference between truth and false... I think the world will look back on this as a very strange era having that kind of a leader.\"\n\nHe was, however, hopeful: “But, we'll get through this together.\"\n\nHe said it is ‘unfortunate’ for science funding to be predicated by its practical applications in the near future. \"In many cases, they expect practical technologies from basic science in a few years. But for power technological applications, it will take decades of research to find applications,\" he said.\n\nOf the six awardees of the Infosys Science Award, two had conducted their pioneering research in the National Centre for Biological Science (NCBS). The awardees were selected by a jury that included Nobel laureate Amartya Sen, India’s former chief economic adviser Kaushik Basu, and molecular biologist Inder Verma.\n\nIn the Life Sciences category, NCBS neurobiologist Upinder Singh Bhalla was awarded for his work on understanding the brain’s computational machinery, particularly of the mammalian olfactory system.\n\nYamuna Krishnan from the Department of Chemistry in University of Chicago, who did pioneering work on DNA architecture and development of DNA nano-devices at NCBS, was awarded the 2017 Physical Sciences award. \"NCBS is a very special institute, for you meet people who can make the extraordinary out of the ordinary. It is an institute that dares to dream,\" she said on receiving the award.\n\nOther awardees included Sanghamitra Bandyopadhyay, director of Indian Statistical Institute, Kolkata, in the Engineering and Computer Sciences category for her work on computer algorithms that can analyse patterns, even in genomic sequence.\n\nLawrence Liang from the School of Law, Ambedkar University, Delhi, received the Social Sciences award for his ‘Creative Scholarship’ on law and society.\n\nRitabrata Munshi from Tata Institute of Fundamental Research, Mumbai, was the winner in the category of Mathematical Sciences, for his work on number theory, while Ananya J. Kabir was given the Humanities award.\n\nThe prize comes with a ₹65 lakh purse, a medal and a citation.",
        "summary": {
            "sentences": [
                "In an era when leaders such as the President of the United States of America Donald Trump are driven by ideological reasons rather than scientific fact, it is incumbent on scientists to educate the public about the power of science to solve critical problems, said Nobel laureate Kip Thorne during the Infosys Science Foundation Awards presentation ceremony on Wednesday.",
                "Mr. Thorne, who won the Nobel Prize for Physics in 2017 for his work on gravitational waves, said the Nobel prize and awards such as these thrust scientists into becoming an ‘icon of science’ in the eyes of the general public.",
                "\"We scientists have an obligation to educate the public and our leaders about scientific fact and the power of science to resolve our problems.",
                "Of the six awardees of the Infosys Science Award, two had conducted their pioneering research in the National Centre for Biological Science (NCBS).",
                "Ritabrata Munshi from Tata Institute of Fundamental Research, Mumbai, was the winner in the category of Mathematical Sciences, for his work on number theory, while Ananya J. Kabir was given the Humanities award."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "neutral",
                "score": 0.538078
            },
            "body": {
                "polarity": "positive",
                "score": 0.715164
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.thehindu.com/news/cities/bangalore/scientists-must-uphold-facts-when-leaders-like-trump-are-dismissive-of-it/article22414061.ece?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93097051",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93097051",
            "canonical": null
        }
    },
    {
        "id": 93748723,
        "title": "Doctor says US President Donald Trump 'is in excellent health'",
        "body": "Dr Ronny Jackson says in a statement released by the White House that US President Donald Trump's physical \"went exceptionally well.''\n\nJackson said he looks forward to proving additional details at a White House briefing Tuesday.\n\nThe statement was distributed after the president received his first physical since taking office at Walter Reed military hospital. The normally routine examination coincided with swirling questions about Trump's physical and medical fitness for office.\n\nThe president has pushed back against suggestions he's mentally unfit, declaring himself \"a very stable genius.''\n\nREAD MORE:\n\n * 'He doesn't look healthy': Trump to undergo first official exam\n\n * The Donald Trump diet, or eat yourself furious!\n\n * Trump's Diet Coke addiction could affect brain function\n\n * Trump's huge McDonald's order is even weirder than you thought\n\n * Donald Trump says he's 'like, really smart' and 'a very stable genius'\n\nTrump received his first medical checkup as president at Walter Reed military hospital.\n\nThe US president boarded Marine One at the medical facility in Bethesda, Maryland, outside Washington, Friday afternoon after about three hours at the hospital.\n\nTrump shook hands with his physician, Dr Ronny Jackson, and then waved before boarding his helicopter. The president is travelling to Florida later in the day for the weekend.\n\nThe check-up comes amid suggestions in a recent book and by the president's detractors that he's mentally unfit.\n\nThe fairly routine exam for previous presidents has taken on outsized importance in the age of Trump. That's in light of the tone of some of his tweets, comments attributed to some of his close advisers and Trump's recent slurring of words on national TV.\n\nThe normally routine exam has taken on outsized importance given the tone of some of Trump's tweets, comments attributed to some of his close advisers and Trump's recent slurring of words on national TV.\n\nSome of the comments were published in Michael Wolff's book, Fire and Fury: Inside the Trump White House. The White House has called it \"complete fantasy.''\n\nTrump's two previous visits to Walter Reed were to cheer wounded service members.",
        "summary": {
            "sentences": [
                "Dr Ronny Jackson says in a statement released by the White House that US President Donald Trump's physical \"went exceptionally well.''",
                "* Trump's Diet Coke addiction could affect brain function\n\n * Trump's huge McDonald's order is even weirder than you thought\n\n * Donald Trump says he's 'like, really smart' and 'a very stable genius'\n\nTrump received his first medical checkup as president at Walter Reed military hospital.",
                "The fairly routine exam for previous presidents has taken on outsized importance in the age of Trump.",
                "That's in light of the tone of some of his tweets, comments attributed to some of his close advisers and Trump's recent slurring of words on national TV.",
                "The normally routine exam has taken on outsized importance given the tone of some of Trump's tweets, comments attributed to some of his close advisers and Trump's recent slurring of words on national TV."
            ]
        },
        "source": null,
        "author": null,
        "entities": null,
        "keywords": null,
        "hashtags": null,
        "characters_count": null,
        "words_count": null,
        "sentences_count": null,
        "paragraphs_count": null,
        "categories": null,
        "social_shares_count": null,
        "media": null,
        "sentiment": {
            "title": {
                "polarity": "positive",
                "score": 0.504485
            },
            "body": {
                "polarity": "positive",
                "score": 0.687706
            }
        },
        "language": null,
        "published_at": null,
        "links": {
            "permalink": "http://www.stuff.co.nz/world/americas/100552431/Doctor-says-US-President-Donald-Trump-is-in-excellent-health",
            "related_stories": "https://api.newsapi.aylien.com/api/v1/related_stories?story_id=93748723",
            "coverages": "https://api.newsapi.aylien.com/api/v1/coverages?story_id=93748723",
            "canonical": null
        }
    }
]